[
  "Actions speak louder than words, and yours tell an incredible story.",
  "You deserve an award for everything you do.",
  "You're even better than a unicorn because you're real.",
  "You're more fun than bubble wrap.",
  "You’re the fiercest person I know.",
  "You have the best ideas.",
  "You always know how to have fun.",
  "Any team should be grateful to have you on it.",
  "Jokes are funnier when you tell them.",
  "You could survive a zombie apocalypse.",
  "I love how you can turn even the simplest situation into something fun.",
  "You’ re the sweetest— you don’ t have a mean bone in your body, do you ?",
  "When you make a mistake, you fix it.",
  "You're really something special.",
  "I appreciate you.",
  "Your perspective is refreshing.",
  "You're strong.",
  "When you get famous, I want to be the president of your fan club.",
  "You're like sunshine on a rainy day.",
  "Your kindness is a balm to all who encounter it.",
  "Whoever raised you deserves a medal for a job well-done.",
  "It's great to know that you've got my back.",
  "Your smile is contagious.",
  "You’re so kind that you make everyone around you a better person.",
  "You always know just what to say.",
  "I’m proud of how far you have come and for never giving up.",
  "You’re the bravest person I know!I wish I was more like you.",
  "The way you treasure your loved ones is incredible.",
  "You are brave.",
  "You have the best laugh.",
  "You have impeccable manners.",
  "You're a gift to those around you.",
  "There are so many different things that make you really interesting.",
  "You are an incredible human.",
  "You're an awesome friend.",
  "Is that your picture next to \"charming\" in the dictionary?",
  "Is there anything you can’t do?",
  "You make the world more interesting.",
  "You're a smart cookie.",
  "Please never stop being you!",
  "Your creative potential seems limitless.",
  "There's a reason people are drawn to you.",
  "Your smile lights up the room.",
  "I’ve never met anyone as caring as you.",
  "I am so proud of you, and I hope you are too!",
  "Everything would be better if more people were like you.",
  "You're one of a kind.",
  "You’re irreplaceable.",
  "Everyone gets knocked down sometimes; only people like you get back up again and keep going.",
  "You're more helpful than you realize.",
  "You're the best at finding silver linings.",
  "I like your style.",
  "You look great today.",
  "It’s too bad every boss can’t be like you.",
  "You're wonderful.",
  "You're inspiring.",
  "Anyone would be lucky to have you work for them!",
  "You are making a difference.",
  "You deserve all the credit you're getting.",
  "You're someone's reason to smile.",
  "When I grow up, I want to be just like you.",
  "You seem to really know who you are.",
  "You're the only person who can always make me laugh.",
  "Your confidence is infectious.",
  "Your heart must be ten times the average size.",
  "You are enough.",
  "When you say, \"I meant to do that,\" I actually believe you.",
  "You always know what to say to make me feel better.",
  "I love how you decorated your house. It looks like it belongs on HGTV.",
  "There's ordinary, and then there's you.",
  "If you were a cartoon character, you'd be the one that gets bluebirds to sing on your shoulders.",
  "When you make up your mind, nothing stands in your way.",
  "You have been glowing lately.",
  "I bet you can make even the crankiest babies smile.",
  "On a scale from 1 to 10, you're an 11.",
  "Colors seem brighter when you're around.",
  "Hipsters are probably jealous of how cool you arel",
  "Your hugs make all my troubles melt away.",
  "The world is better because you're in it.",
  "You have the courage of your convictions.",
  "Being around you is like a happy little vacation.",
  "You are perfect just the way you are.",
  "You have such a great personality.",
  "You set such a good example for your kids.",
  "You're better than a triple-scoop ice cream cone…with sprinkles.",
  "Your hard work is going to take you far.",
  "You've got all the right moves.",
  "You're like a breath of fresh air.",
  "Your passion motives me.",
  "You have a great sense of humor.",
  "If you were a scented candle, you'd be the rare one that actually smells like what it's supposed to.",
  "If someone based an Internet meme on you, it would have impeccable grammar.",
  "You're a great listener.",
  "You're always learning new things and trying to better yourself. That's awesome.",
  "You light up the room.",
  "Great job today.I love working with you!",
  "I always enjoy talking to you because you are such a great listener.",
  "Time spent with you is always worth it.",
  "The best perk of this job is working with you.",
  "Wow, you’re talented beyond your years!",
  "I wish I were half of the human you are.",
  "You have a good head on your shoulders.",
  "You're great at figuring stuff out.",
  "I wish I could figure things out as quickly as you do.",
  "You should be thanked more often.",
  "Your friends are lucky to have you in their lives.",
  "There's just something about you that shines.",
  "In high school, I bet you were voted \"Best, period.\"",
  "You're so thoughtful.",
  "Your energy is infectious!",
  "You bring out the best in other people.",
  "How do you know so much about everything?",
  "You're a great example to others.",
  "I love your confidence. Can you send some of it my way?",
  "Your creativity is on another level!",
  "You never fail to impress me.",
  "You are beautiful on the inside and outside.",
  "You’re such a ray of sunshine.",
  "Being around you makes everything better.",
  "You always bring out the best in people. It’s no wonder you’re good at your job.",
  "You always seem to know what others need.",
  "Hanging out with you is always a good time.",
  "Talking to you is like a breath of fresh air.",
  "I bet you do crossword puzzles in ink.",
  "How do you make sweatpants look so good?",
  "You’re so kind everyone instantly feels like your friend.",
  "You’re a natural at whatever you do!"
]
