[
  "Your smile is contagious.",
  "I bet you can make even the crankiest babies smile.",
  "You have the best laugh.",
  "You light up the room.",
  "You have a great sense of humor.",
  "If you were a cartoon character, you'd be the one that gets bluebirds to sing on your shoulders.",
  "You're like sunshine on a rainy day.",
  "You bring out the best in other people.",
  "There's just something about you that shines.",
  "Colors seem brighter when you're around.",
  "You always know how to have fun.",
  "Jokes are funnier when you tell them.",
  "You're the best at finding silver linings.",
  "You always know what to say to make me feel better.",
  "Being around you is like a happy little vacation.",
  "You're more fun than bubble wrap.",
  "You're like a breath of fresh air.",
  "You're someone's reason to smile.",
  "You're the only person who can always make me laugh.",
  "You have impeccable manners.",
  "I like your style.",
  "You're strong.",
  "Is that your picture next to \"charming\" in the dictionary?",
  "Your kindness is a balm to all who encounter it.",
  "You are brave.",
  "You are beautiful on the inside and outside.",
  "You have the courage of your convictions.",
  "You're a great listener.",
  "Hipsters are probably jealous of how cool you arel",
  "There are so many different things that make you really interesting.",
  "You're inspiring.",
  "You're so thoughtful.",
  "When you make up your mind, nothing stands in your way.",
  "You seem to really know who you are.",
  "You're a smart cookie.",
  "Your perspective is refreshing.",
  "How do you know so much about everything?",
  "When you say, \"I meant to do that,\" I actually believe you.",
  "You have the best ideas.",
  "You're always learning new things and trying to better yourself. That's awesome.",
  "If someone based an Internet meme on you, it would have impeccable grammar.",
  "You could survive a zombie apocalypse.",
  "When you make a mistake, you fix it.",
  "You're great at figuring stuff out.",
  "Your creative potential seems limitless.",
  "I bet you do crossword puzzles in ink.",
  "You have a good head on your shoulders.",
  "Everyone gets knocked down sometimes; only people like you get back up again and keep going.",
  "I am so proud of you, and I hope you are too!",
  "You are making a difference.",
  "You deserve all the credit you're getting.",
  "You're a great example to others.",
  "Actions speak louder than words, and yours tell an incredible story.",
  "You're an awesome friend.",
  "You're more helpful than you realize.",
  "Hanging out with you is always a good time.",
  "You always seem to know what others need.",
  "Being around you makes everything better.",
  "You should be thanked more often.",
  "The world is better because you're in it.",
  "It's great to know that you've got my back.",
  "You always know just what to say.",
  "Your friends are lucky to have you in their lives.",
  "Any team should be grateful to have you on it.",
  "There's a reason people are drawn to you.",
  "The way you treasure your loved ones is incredible.",
  "You're a gift to those around you.",
  "You have been glowing lately.",
  "You look great today.",
  "Your smile lights up the room.",
  "Your confidence is infectious.",
  "You have such a great personality.",
  "I appreciate you.",
  "You are perfect just the way you are.",
  "You are enough.",
  "On a scale from 1 to 10, you're an 11.",
  "You've got all the right moves.",
  "Everything would be better if more people were like you.",
  "You are an incredible human.",
  "You're wonderful.",
  "You're one of a kind.",
  "Whoever raised you deserves a medal for a job well-done.",
  "Time spent with you is always worth it.",
  "In high school, I bet you were voted \"Best, period.\"",
  "If you were a scented candle, you'd be the rare one that actually smells like what it's supposed to.",
  "There's ordinary, and then there's you.",
  "You're even better than a unicorn because you're real.",
  "You're really something special.",
  "You’re a natural at whatever you do!",
  "You’re the bravest person I know!I wish I was more like you.",
  "You're better than a triple-scoop ice cream cone…with sprinkles.",
  "You’ re the sweetest— you don’ t have a mean bone in your body, do you ?",
  "Talking to you is like a breath of fresh air.",
  "Great job today.I love working with you!",
  "Your energy is infectious!",
  "You’re so kind that you make everyone around you a better person.",
  "I love how you can turn even the simplest situation into something fun.",
  "I wish I were half of the human you are.",
  "Your creativity is on another level!",
  "I love how you decorated your house. It looks like it belongs on HGTV.",
  "When you get famous, I want to be the president of your fan club.",
  "You set such a good example for your kids.",
  "You’re irreplaceable.",
  "It’s too bad every boss can’t be like you.",
  "I love your confidence. Can you send some of it my way?",
  "You’re so kind everyone instantly feels like your friend.",
  "I wish I could figure things out as quickly as you do.",
  "I’m proud of how far you have come and for never giving up.",
  "I’ve never met anyone as caring as you.",
  "Please never stop being you!",
  "Your hugs make all my troubles melt away.",
  "You make the world more interesting.",
  "Your heart must be ten times the average size.",
  "You never fail to impress me.",
  "You’re such a ray of sunshine.",
  "Is there anything you can’t do?",
  "Anyone would be lucky to have you work for them!",
  "You deserve an award for everything you do.",
  "How do you make sweatpants look so good?",
  "You’re the fiercest person I know.",
  "When I grow up, I want to be just like you.",
  "The best perk of this job is working with you.",
  "Your hard work is going to take you far.",
  "You always bring out the best in people. It’s no wonder you’re good at your job.",
  "Your passion motives me.",
  "Being around you is like a happy little vacation.",
  "I always enjoy talking to you because you are such a great listener.",
  "Wow, you’re talented beyond your years!"
]
