[
  "More than 1,000 different languages are spoken on the continent of Africa.",
  "Barbie's full name is Barbara Millicent Roberts.",
  "Julius Caesar’s autograph is worth about $2,000,000.",
  "The muzzle of a lion is like a fingerprint - no two lions have the same pattern of whiskers.",
  "Venus is the only planet that rotates clockwise.",
  "Barbie's full name is 'Babara Millicent Roberts'.",
  "In ancient Greece 'idiot' meant a private citizen or layman.",
  "Starfish have no brains.",
  "All US Presidents have worn glasses; some just didn't like being seen wearing them in public.",
  "The name Jeep came from the abbreviation used in the army. G.P. for 'General Purpose' vehicle.",
  "A man will ejaculate approximately 18 quarts of semen in his lifetime.",
  "Months that begin on a Sunday will always have a 'Friday the 13th'.",
  "Daylight Saving Time is not observed in most of the state of Arizona and parts of Indiana.",
  "Your ribs move about 5 million times a year, every time you breathe!",
  "Ninety percent of all species that have become extinct have been birds.",
  "A 2' X 4' is really 1-1/2' by 3-1/2'.",
  "'Obsession' is the most popular boat name.",
  "Al Capone’s business card said he was a used furniture dealer.",
  "A 'jiffy' is a unit of time for 1/100th of a second.",
  "Maine is the only state (in USA) whose name is just one syllable.",
  "The most common street name in the U.S. is Second Street.",
  "Coca-Cola would be green if coloring weren’t added to it.",
  "The Boston University Bridge (on Commonwealth Avenue, Boston, Massachusetts) is the only place in the world where a boat can sail under a train driving under a car driving under an airplane.",
  "Babies are born without knee caps. They don't appear until the child reaches 2-6 years of age.",
  "Until 1997, there were more pigs than people in Denmark.",
  "The expression 'to get fired' comes from long ago Clans that wanted to get rid of unwanted people, so they would burn their houses instead of killing them, creating the term 'Got fired'.",
  "The name Jeep comes from “GP”, the army abbreviation for General Purpose.",
  "A cockroach can live several weeks with its head cut off!",
  "Ramses brand condom is named after the great pharaoh Ramses II who fathered over 160 children.",
  "You spend 7 years of your life in the bathroom.",
  "Bulgarians are known to be the biggest yogurt eaters in the world.",
  "John Lennon's first girlfriend was named Thelma Pickles.",
  "It’s estimated that at any one time around 0.7% of the world’s population is drunk.",
  "More bullets were fired in 'Starship Troopers' than any other movie ever made.",
  "0.3% of all road accidents in Canada involve a Moose.",
  "Oak trees do not produce acorns until they are fifty years of age or older.",
  "Dr. Kellogg introduced Kellogg's Corn Flakes in hopes that it would reduce masturbation.",
  "Camel’s have three eyelids.",
  "In the last 4000 years no new animals have been domesticated.",
  "The only domestic animal not mentioned in the Bible is the cat.",
  "Because metal was scarce, the Oscars given out during World War II were made of wood.",
  "A “jiffy” is the scientific name for 1/100th of a second.",
  "Andorra, a tiny country between France & Spain, has the longest average lifespan: 83.49 years.",
  "The first automobile race ever seen in the United States was held in Chicago in 1895. The track ran from Chicago to Evanston, Illinois. The winner was J. Frank Duryea, whose average speed was 71/2 miles per hour.",
  "There were 240 pedestrian fatalities in New York City in 1994.",
  "In New York State, it is illegal to but any alcohol on Sundays before noon.",
  "Q is the only letter in the alphabet that does not appear in the name of any of the United States!",
  "Humphrey Bogart NEVER said “Play it again, Sam” in Casablanca",
  "Mexico City sinks about 10 inches a year",
  "The 'save' icon on Microsoft Word shows a floppy disk with the shutter on backwards.",
  "Cranberries are sorted for ripeness by bouncing them; a fully ripened cranberry can be dribbled like a basketball.",
  "If you plant an apple seed, it is almost guaranteed to grow a tree of a different type of apple.",
  "There are 269 steps to the top of the Leaning Tower of Pisa",
  "Of all the words in the English language, the word 'set' has the most definitions!",
  "Lithuania has the highest suicide rate in the world.",
  "Mr. Rogers was an ordained Presbyterian minister.",
  "11% of the world is left-handed.",
  "Adolf Hitler's mother seriously considered having an abortion but was talked out of it by her doctor.",
  "The microwave was invented after a researcher walked by a radar tube and a chocolate bar melted in his pocket.",
  "If done perfectly, a rubix cube combination can be solved in 17 turns.",
  "The placement of a donkey's eyes in it’s' heads enables it to see all four feet at all times!",
  "In Quebec, there is an old law that states margarine must be a different color than butter.",
  "A skunk's smell can be detected by a human a mile away.",
  "The longest one-syllable word in the English language is 'screeched'.",
  "The Amazon is the world's largest river, 3,890 miles (6,259 km) long.",
  "The first streetlights in America were installed in Philadelphia around 1757.",
  "The U.S. city with the highest rate of lightning strikes per capita is Clearwater, Florida.",
  "The scene where Indiana Jones shoots the swordsman in Raider’s of the Lost Ark was Harrison Ford's idea so that he could take a bathroom break.",
  "Shakespeare invented the words “assassination” and “bump.”",
  "Most Egyptians died by the time they were 30 about 300 years ago,",
  "An American urologist bought Napoleon’s penis for $40,000.",
  "Intelligent people have more zinc and copper in their hair.",
  "One quarter of the bones in your body, are in your feet!",
  "In 1386, a pig in France was executed by public hanging for the murder of a child",
  "There are about 2 chickens for every human in the world.",
  "An average human scalp has 100,000 hairs.",
  "The San Francisco Cable cars are the only mobile National Monuments",
  "Walt Disney was afraid of mice.",
  "The surface of the human skin is 6.5 square feet (2m).",
  "Fish that live more than 800 meters below the ocean surface don't have eyes.",
  "A crocodiles tongue is attached to the roof of its mouth.",
  "Dr. Jack Kevorkian first patient has Alzheimer's disease.",
  "Human thighbones are stronger than concrete.",
  "The word 'samba' means 'to rub navels together'.",
  "A cow gives nearly 200,000 glasses of milk in her lifetime.",
  "The thyroid cartilage is more commonly known as the adams apple.",
  "”Judge Judy” has a $25,000,000 salary, while Supreme Court Justice Ginsberg has a $190,100 salary.",
  "%60 of all people using the Internet, use it for pornography.",
  "The average shelf-life of a latex condom is about two years.",
  "The 57 on Heinz ketchup bottles represents the number of varieties of pickles the company once had.",
  "Every year 4 people in the UK die putting their trousers on.",
  "The name Wendy was made up for the book Peter Pan. There was never a recorded Wendy before it.",
  "The average American works 24,000 hours in their lifetime just to pay their taxes",
  "There are 293 ways to make change for a dollar.",
  "The only real person to ever to appear on a pez dispenser was Betsy Ross.",
  "Rape is reported every six minutes in the U.S.",
  "A cockroach will live nine days without its head before it starves to death.",
  "Ants closely resemble human manners: When they wake, they stretch & appear to yawn in a human manner before taking up the tasks of the day.",
  "Sigmund Freud had a morbid fear of ferns.",
  "Dolphins sleep with one eye open!",
  "The people of France eat more cheese than any other country in the world.",
  "Most toilets flush in E flat.",
  "The thumbnail grows the slowest, the middle nail the fastest, nearly 4 times faster than toenails.",
  "The only nation whose name begins with an 'A', but doesn't end in an 'A' is Afghanistan.",
  "The pancreas produces Insulin.",
  "The electric chair was invented by a dentist.",
  "Our eyes are always the same size from birth, but our nose and ears never stop growing.",
  "All 50 states are listed across the top of the Lincoln Memorial on the back of the $5 bill.",
  "Canada makes up 6.67 percent of the Earth's land area",
  "A polar bears skin is black. Its fur is actually clear, but like snow it appears white.",
  "Chewing gum while peeling onions will keep you from crying.",
  "The Pentagon, in Arlington, Virginia, has twice as many bathrooms as is necessary, because when it was built in the 1940s, the state of Virginia still had segregation laws requiring separate toilet facilities for blacks and whites.",
  "God is not mentioned once in the book of Esther.",
  "The catfish has the most taste buds of all animals, having over 27,000 of them.",
  "Simplistic passwords contribute to over 80% of all computer password break-ins.",
  "There is a town in Newfoundland, Canada called Dildo.",
  "Weatherman Willard Scott was the first original Ronald McDonald.",
  "Giraffes have no vocal cords.",
  "Negative emotions such as anxiety and depression can weaken your immune system.",
  "It's illegal to spit on the sidewalk in Norfolk, Virginia.",
  "The Australian $5 to $100 notes are made of plastic.",
  "There are more than 10 million bricks in the Empire State Building!",
  "On a Canadian two dollar bill, the flag flying over the Parliament buildings is an American flag.",
  "Beethoven dipped his head in cold water before he composed.",
  "Hannibal had only one eye after getting a disease while attacking Rome.",
  "People say “bless you” when you sneeze because your heart stops for a millisecond.",
  "The state of Florida is bigger than England.",
  "The Eisenhower interstate system requires that one mile in every five must be straight in case of war or emergency, they could be used as airstrips.",
  "Some individuals express concern sharing their soap, rightly so, considering 75% of all people wash from top to bottom.",
  "A rhinoceros horn is made of compacted hair.",
  "If you yelled for 8 years, 7 months and 6 days, you will have produced enough sound energy to heat one cup of coffee.",
  "The only real person to be a PEZ head was Betsy Ross.",
  "Bullet proof vests, fire escapes, windshield wipers, and laser printers were all invented by women",
  "No word in the English language rhymes with month, orange, silver, or purple.",
  "'I' is the most spoken word in the English language",
  "14% of Americans have skinny-dipped with a member of the opposite sex at least once.",
  "Bees have 5 eyes. There are 3 small eyes on the top of a bee's head and 2 larger ones in front.",
  "An ostrich's eye is bigger than its brain.",
  "The house fly hums in the middle octave key of F.",
  "Sir Isaac Newton was only 23 years old when he discovered the law of universal gravitation.",
  "The average American/Canadian will eat about 11.9 pounds of cereal per year!",
  "Each month, there is at least one report of UFOs from each province of Canada.",
  "Half of all bank robberies take place on a Friday.",
  "A duck's quack doesn't echo, and no one knows why.",
  "The Great Wall of China is the only man-made structure visible from space.",
  "The first toilet ever seen on television was on 'Leave It to Beaver'.",
  "Cuba is the only island in the Caribbean to have a railroad.",
  "One of the reasons marijuana is illegal today is because cotton growers in the 1930s lobbied against hemp farmers they saw it as competition.",
  "More people are afraid of open spaces (kenophobia) than of tight spaces (claustrophobia).",
  "No piece of square dry paper can be folded in half more than 7 times",
  "In 10 minutes, a hurricane releases more energy than all the world’s nuclear weapons combined.",
  "The average person spends 12 weeks a year 'looking for things'.",
  "Who's that playing the piano on the 'Mad About You' theme? Paul Reiser himself.",
  "The longest place-name still in use is: Taumatawhakatangihangakoauauotamateaturipukakapikimaungahoronukupokaiakitnatahu, a New Zealand hill.",
  "The name of all continents in the world end with the same letter that they start with.",
  "Humans and dolphins are the only species that have sex for pleasure.",
  "Ancient Egyptians shaved off their eyebrows to mourn the deaths of their cats.",
  "In the Philippine jungle, the yo-yo was first used as a weapon.",
  "At the height of its power in 400 BC, the Greek city of Sparta had 25,000 citizens and 500,000 slaves.",
  "Poland is the 'stolen car capital of the world'.",
  "No word in the English language rhymes with month, orange, silver and purple.",
  "The storage capacity of human brain exceeds 4 Terabytes.",
  "The value of Pi will be officially 'rounded down' to 3.14 from 3.14159265359 on December 31, 1999.",
  "The symbol on the 'pound' key (#) is called an octothorpe..",
  "There are 10 human body parts that are only 3 letters long (eye hip arm leg ear toe jaw rib lip gum).",
  "Tigers have striped skin, not just striped fur.",
  "Camels chew in a figure 8 pattern.",
  "'You' is the second most spoken English word",
  "Astronaut Neil Armstrong first stepped on the moon with his left foot.",
  "The human feet perspire half a pint of fluid a day",
  "Thirty-five percent of the people who use personal ads for dating are already married.",
  "A jellyfish is 95 percent water!",
  "A shark is the only fish that can blink with both eyes.",
  "If you have three quarters, four dimes, and four pennies, you have $1.19, the largest amount of money in coins without being able to make change for a dollar.",
  "Fingernails grow nearly 4 times faster than toenails!",
  "The HyperMart outside of Garland Texas has 58 check-outs.",
  "Dr. Seuss pronounced his name “soyce”.",
  "The average person's left hand does 56% of the typing.",
  "The the U.S. you dial '911'. In Stockholm, Sweden you dial 90000",
  "A giraffe can go without water longer than a camel.",
  "When you sneeze, air and particles travel through the nostrils at speeds over100 mph. During this time, all bodily functions stop, including your heart, contributing to the impossibility of keeping one's eyes open during a sneeze.",
  "Sweden has the least number of murders annually.",
  "The Vatican city registered 0 births in 1983",
  "Every acre of American crops harvested contains 100 pounds of insects.",
  "Dreamt is the only English word that ends in the letters “MT”.",
  "A cat has 32 muscles in each ear.",
  "There is no solid proof of who built the Taj Mahal.",
  "There are more donut shops in Canada per capita than any other country.",
  "Recycling one glass jar, saves enough energy to watch T.V for 3 hours!",
  "While in Alcatraz, Al Capone was inmate #85.",
  "The U.S. bought Alaska for 2 cents an acre from Russia.",
  "If you keep a goldfish in the dark room, it will eventually turn white.",
  "A palindrome is a sentence or group of sentences that reads the same backwards as it does forward: Ex: 'Red rum, sir, is murder'. 'Ma is as selfless as I am'. 'Nurse, I spy gypsies. Run!'. 'A man, a plan, a canal - Panama'. 'He lived as a devil, eh?'",
  "Steely Dan got their name from a sexual device depicted in the book 'The Naked Lunch'.",
  "The average North American will eat 35,000 cookies during their life span.",
  "1 in 5 of the world's doctors are Russian.",
  "Every day, 7% of the US eats at McDonald’s.",
  "The word 'dexter' whose meaning refers to the right hand is typed with only the left hand.",
  "Each year in America there are about 300,000 deaths that can be attributed to obesity.",
  "There are no words in the dictionary that rhyme with orange, purple, silver and month.",
  "'Go'. is the shortest complete sentence in the English language.",
  "A jellyfish is 95% water.",
  "Rubber bands last longer when refrigerated.",
  "Australian soldiers used the song 'We're Off to See the Wizard' as a marching song in WWII.",
  "The human body is comprised of 80% water.",
  "In every episode of Seinfeld there is a Superman somewhere.",
  "Deborah Winger did the voice of E.T.",
  "The San Francisco Cable cars are the only mobile National Monuments.",
  "Gabriel, Michael, and Lucifer are the only angels named in the Bible.",
  "Conception occurs most in the month of December.",
  "In England, the Speaker of the House is not allowed to speak.",
  "Jefferson invented the dumbwaiter, the monetary system, and the folding attic ladder.",
  "In eighteenth-century English gambling dens, there was an employee whose only job was to swallow the dice if there was a police raid.",
  "California has issued 6 drivers licenses to people named 'Jesus Christ'.",
  "'Underground' is the only word in the English language that begins and ends with the letters 'und'",
  "In Japan, watermelons are squared. It's easier to stack them that way.",
  "Koala is Aboriginal for 'no drink'.",
  "A cat's jaw cannot move sideways.",
  "'Stewardesses' is the longest word that is typed with only the left hand.",
  "All of the clocks in the movie 'Pulp Fiction' are stuck on 4:20, a national pot-smokers hour.",
  "A crocodile cannot stick its tongue out.",
  "Winston Churchill was born in a ladies' room during a dance.",
  "A healthy (non-colorblind) human eye can distinguish between 500 shades of gray.",
  "The highest per capita Jell-O comsumption in the US is Des Moines.",
  "Ancient Egyptian priests would pluck every hair from their bodies.",
  "When a Hawaiian woman wears a flower over her left ear, it means that she is not available.",
  "The word Pennsylvania is misspelled on the Liberty Bell.",
  "Emus and kangaroos cannot walk backwards, and are on the Australian coat of arms for that reason.",
  "American Airlines saved $40,000 in 1987 by eliminating one olive from each salad served in first-class.",
  "In the last 4000 years, no new animals have been domesticated.",
  "Benjamin Franklin was the fifth in a series of the youngest son of the youngest son.",
  "Baby Ruth candy bar was named after Grover Cleveland’s daughter, Ruth, not the baseball player.",
  "Right handed people live, on average, nine years longer than left handed people do.",
  "Gary, Indiana is the murder capital of the U.S. - probably the world.",
  "It takes more calories to eat a piece of celery than the celery has in it to begin with.",
  "A “quidnunc” is a person who is eager to know the latest news and gossip.",
  "Illinois has the highest number of personalized license plates than any other state.",
  "In Disney's Fantasia, the Sorcerer's name is 'Yensid' (Disney backwards.)",
  "Studies show that if a cat falls off the seventh floor of a building it has about thirty percent less chance of surviving than a cat that falls off the twentieth floor. It supposedly takes about eight floors for the cat to realize what is occurring, relax and correct itself.",
  "Warren Beatty and Shirley McLaine are brother and sister.",
  "The verb 'cleave' is the only English word with two synonyms which are antonyms of each other: adhere and separate.",
  "A rat can last longer without water than a camel.",
  "The letters KGB stand for Komitet Gosudarstvennoy Bezopasnosti.",
  "The Olympic was the sister ship of the Titanic, and she provided twenty-five years of service.",
  "15 million blood cells are destroyed in the human body every second.",
  "40% of all people who come to a party in your home snoop in your medicine cabinet",
  "It's possible to lead a cow upstairs...but not downstairs.",
  "People photocopying their buttocks are the cause of 23% of all photocopier faults worldwide.",
  "The average lead pencil will draw a line 35 miles long or write approximately 50,000 English words. More than 2 billion pencils are manufactured each year in the United States. If these were laid end to end they would circle the world nine times.",
  "The Earth experiences 50,000 Earth quakes per year and is hit by Lightning 100 times a second.",
  "The giant squid has the largest eyes in the world.",
  "The sound of E.T. walking was made by someone squishing her hands in jelly.",
  "Chinese Crested dogs can get acne.",
  "Jim Henson first coined the word “Muppet”. It is a combination of “marionette” and “puppet.”",
  "Van Gogh only sold one painting when he was alive.",
  "40,000 Americans are injured by toilets each year.",
  "10,000 Dutch cows pass through the Amsterdam airport each year.",
  "A word or sentence that is the same front and back (racecar, kayak) is called a “palindrome”.",
  "Bruce Lee was so fast that they had to slow the film down so you could see his moves.",
  "A lion in the wild usually makes no more than 20 kills a year.",
  "Americans travel 1,144,721,000 miles by air every day",
  "Odds of being killed by lightening? 1 in 2million/killed in a car crash? 1 in 5,000/killed by falling out of bed? 1 in 2million/killed in a plane crash? 1 in 25 million.",
  "The very first bomb dropped by the Allies on Berlin during World War II Killed the only elephant in the Berlin Zoo.",
  "Banging your head against a wall uses 150 calories an hour.",
  "Elephants are the only animals that can't jump.",
  "The name for Oz in the 'Wizard of Oz' was thought up when the creator, Frank Baum, looked at his filing cabinet and saw A-N, and O-Z; hence the name 'OZ'.",
  "IBM’s motto is “Think”. Apple later made their motto “Think different”.",
  "Nerve impulses to and from the brain travel as fast as 170 miles (274 km) per hour.",
  "Daniel Boone hated coonskin caps.",
  "The word 'Checkmate' in chess comes from the Persian phrase 'Shah Mat,' which means 'the king is dead'.",
  "There are no clocks in Las Vegas gambling casinos.",
  "Ninety percent of New York City cabbies are recently arrived immigrants.",
  "101 Dalmatians, Peter Pan, Lady and the Tramp, and Mulan are the only Disney cartoons where both parents are present and don't die throughout the movie.",
  "The 'Dull Men's Hall of Fame' is located in Carroll, Wisconsin.",
  "Length of beard an average man would grow if he never shaved 27.5 feet",
  "The human tongue tastes bitter things with the taste buds toward the back. Salty and pungent flavors are tasted in the middle of the tongue, sweet flavors at the tip!",
  "John Lennon’s first girlfriend was named Thelma Pickles.",
  "For some time Frederic Chopin, the composer and pianist, wore a beard on only one side of his face, explaining: 'It does not matter, my audience sees only my right side'.",
  "There are about 450 types of cheese in the world. 240 come from France.",
  "“Lassie” was played by a group of male dogs; the main one was named Pal.",
  "In The Empire Strikes Back there is a potato hidden in the asteroid field",
  "Half of all Americans live within 50 miles of their birthplace.",
  "In most watch advertisements the time displayed on a watch is 10:10.",
  "The 3 most valuable brand names on earth are Marlboro, Coca-Cola, and Budweiser (in that order).",
  "Reindeer like to eat bananas.",
  "Canadian researchers have found that Einstein's brain was 15% wider than normal.",
  "More people are killed each year from bees than from snakes.",
  "The citrus soda 7-UP was created in 1929; '7' was selected after the original 7-ounce containers and 'UP' for the direction of the bubbles.",
  "Anne Boleyn, Queen Elizabeth I's mother, had six fingers on one hand.",
  "The common idea that only 10% of the brain is used it not true as it is impossible to determine the actual percentage because of the complexity of the brain.",
  "The very first song played on MTV was 'Video Killed The Radio Star' by the Buggles.",
  "Your stomach has to produce a new layer of mucus every 2 weeks otherwise it will digest itself.",
  "Lorne Greene had one of his nipples bitten off by an alligator while he was host of 'Lorne Greene's Wild Kingdom'.",
  "Two-thirds of the world’s eggplant is grown in New Jersey.",
  "You can lead a cow upstairs but not downstairs.",
  "In Utah, it is illegal to swear in front of a dead person.",
  "The national anthem of Greece has 158 verses. No one in Greece has memorized all 158 verses.",
  "US Dollar bills are made out of cotton and linen.",
  "A Czech man, Jan Honza Zampa, holds the record for drinking one liter of beer in 4.11 seconds.",
  "Thomas Edison, acclaimed inventor of the light bulb, was afraid of the dark.",
  "Donkeys kill more people than plane crashes.",
  "Male bats have the highest rate of homosexuality of any mammal.",
  "In space, astronauts are unable to cry, because there is no gravity and the tears won't flow.",
  "Dogs and cats consume over $11 billion worth of pet food a year",
  "You can't kill yourself by holding your breath.",
  "Earth is the only planet not named after a god.",
  "A honeybee can fly at fifteen miles per hour.",
  "The plastic things on the end of shoelaces are called aglets.",
  "Mr. Rogers was an ordained minister.",
  "The state of Maryland has no natural Lakes.",
  "There was once an undersea post office in the Bahamas.",
  "Triskaidekaphobia means fear of the number 13.",
  "You burn more calories sleeping than you do watching TV.",
  "There are 336 dimples on a regulation US golf ball. In the UK its 330.",
  "The average person spends 6 months of their life sitting at red lights.",
  "In the last 3,500 years, there have been approximately 230 years of peace throughout the civilized world.",
  "Frank Lloyd Wright's son invented Lincoln Logs.",
  "There are more psychoanalysts per capita in Buenos Aires than any other place in the world.",
  "The Ramses brand condom is named after the great pharoh Ramses II who fathered over 160 children.",
  "The Declaration of Independence was written on hemp (marijuana) paper.",
  "There are 41,806 different spoken languages in the world today.",
  "WWII fighter pilots in the South Pacific armed their airplanes while stationed with .50 caliber machine gun ammo belts measuring 27 feet before being loaded into the fuselage. If the pilots fired all their ammo at a target, he went through 'the whole 9 yards', hence the term.",
  "315 entries in Webster’s 1996 dictionary were misspelled.",
  "The average Japanese household watches more than 10 hours of television a day.",
  "Nutmeg is extremely poisonous if injected intravenously.",
  "In medieval France, unfaithful wives were made to chase a chicken through town naked.",
  "There are more than 10 million bricks in the Empire State Building.",
  "Wearing headphones for just an hour will increase the bacteria in your ear by 700 times.",
  "Most collect calls are made on father's day.",
  "The average human eats 8 spiders in their lifetime at night.",
  "Because of the rotation of the earth, an object can be thrown farther if it is thrown west.",
  "The most popular first name in the world is Muhammad.",
  "The sun is 330,330 times larger than the earth.",
  "The name of the girl on the statue of liberty is Mother of Exiles.",
  "About 14% of injecting drug users are HIV positive.",
  "The S in Harry S. Truman did not stand for anything.",
  "More than 50% of the people in the world have never made or received a telephone call.",
  "Texas is also the only state that is allowed to fly its state flag at the same height as the U.S. flag.",
  "1,800 cigarettes are smoked per person each year in China.",
  "A raisin dropped in a glass of fresh champagne will bounce up and down continually from the bottom of the glass to the top.",
  "The praying mantis is the only insect that can turn its head",
  "Maine is the only state that has borders with only one other state.",
  "The Nullarbor Plain of Australia covers 100,000 square miles (160,900 km) without a tree.",
  "Elwood Edwards did the voice for the AOL sound files (i.e. “You’ve got Mail!”).",
  "Tehran is the most expensive city on earth.",
  "A cat uses its whiskers to determine if a space is too small to squeeze through.",
  "Every year 11,000 Americans injure themselves while trying out bizarre sexual positions.",
  "The top 3 health-related searches on the Internet are (in this order): Depression, Allergies, & Cancer.",
  "The first female guest host of 'Saturday Night Live' was Candace Bergen.",
  "Your tongue is the only muscle in your body that is attached at only one end.",
  "The world's youngest parents were 8 and 9 and lived in China in 1910.",
  "Leonardo Da Vinci invented the scissors, the helicopter, and many other present day items.",
  "The February of 1865 is the only month in recorded history not to have a full moon.",
  "The only 15-letter word that can be spelled without repeating a letter is uncopyrightable.",
  "Everyday, more money is printed for Monopoly sets than for the U.S. Treasury.",
  "The 'Golden Arches' of fast food chain McDonalds is more recognized worldwide than the religious cross of Christianity.",
  "The average American butt is 14.9 inches long.",
  "Caesar salad has nothing to do with any of the Caesars. It was first concocted in a bar in Tijuana, Mexico, in the 1920's.",
  "Insects outnumber humans 100,000,000 to one.",
  "If you feed a seagull Alka-Seltzer, its stomach will explode.",
  "Like fingerprints, everyone's tongue print is different!",
  "Over 60% of all those who marry get divorced.",
  "The Philippines has about 7,100 islands, of which only about 460 are more than 1 square mile in area.",
  "Sex is the safest tranquilizer in the world. IT IS 10 TIMES MORE EFFECTIVE THAN VALIUM.",
  "One in seven workers in Boston, Massachusetts walks to work.",
  "There is approximately one chicken for every human being in the world.",
  "The average lifespan of an eyelash is five months.",
  "Men can read smaller print than women; women can hear better.",
  "A person cannot taste food unless it is mixed with saliva. For example, if a strong-tasting substance like salt is placed on a dry tongue, the taste buds will not be able to taste it. As soon as a drop of saliva is added and the salt is dissolved, however, a definite taste sensation results. This is true for all foods.",
  "India has a Bill of Rights for cows.",
  "The mother of Michael Nesmith of 'The Monkees' invented whiteout.",
  "The average lead pencil will draw a line 35 miles long or write approximately 50,000 English words.",
  "The eyes of a donkey are positioned so that it can see all four feet at all times.",
  "The largest NFL stadium is the Pontiac Silverdome in Detroit, Michigan.",
  "Sharon Stone was the first Star Search spokes model.",
  "Bob Dylan's real name is Robert Zimmerman.",
  "The angel falls in Venezuela are nearly 20 times taller than Niagara Falls.",
  "Jamaica has the most churches per square mile than any other country in the world.",
  "Emus and kangaroos can't walk backwards.",
  "Maine is the only state whose name is just one syllable.",
  "The U.S. military operates 234 golf courses",
  "$283,200 is the absolute highest amount of money you can win on Jeopardy.",
  "There were always 56 curls in Shirley Temple's hair.",
  "All of the clocks in the movie 'Pulp Fiction' are stuck on 4:20.",
  "The Black Widow spider eats her mate during or after sex.",
  "Antarctica is the only continent that does not have land areas below sea level.",
  "Sharkskin has tiny tooth-like scales all over.",
  "President John F Kennedy could read 4 newspapers in 20 minutes.",
  "Camels have three eyelids to protect themselves from blowing sand!",
  "Right-handed people live, on average; nine years longer than left handed people.",
  "Count the number of cricket chirps in a 15-second period, add 37 to the total, and your result will be very close to the actual outdoor Fahrenheit temperature.",
  "Honking of car horns for a couple that just got married is an old superstition to insure great sex.",
  "Bats always turn left when exiting a cave.",
  "On a Canadian two-dollar bill, the American flag is flying over the Parliament Building.",
  "The international telephone dialing code for Antarctica is 672.",
  "In Aspen Colorado, you can have a maximum income of $104,000 and still receive government subsidized housing.",
  "One in eight million people has progeria, a disease that causes people to grow faster than they age.",
  "Fictional/horror writer Stephen King sleeps with a nearby light on to calm his fear of the dark.",
  "The Automated Teller Machine (ATM) was introduced in England in 1965.",
  "14% of all facts and statistics are made up and 27% of people know that fact.",
  "On the ground, a group of geese is a gaggle, in the sky it is a skein.",
  "80% of burglaries are committed by people aged 13-21.",
  "The airplane Buddy Holly died in was the 'American Pie'. (Thus the name of the Don McLean song.)",
  "Pinocchio is Italian for 'pine head'.",
  "Einstein couldn't speak fluently until after his ninth birthday. His parents thought he was mentally retarded.",
  "There are more than 40,000 characters in the Chinese script.",
  "Only one in two billion people will live to be 116 or older.",
  "When you sneeze, all your bodily functions stop even your heart.",
  "Thirty-five percent of people who use personal ads for dating are already married.",
  "The Hawaiian alphabet has only 12 letters.",
  "Every person, including identical twins, has a unique eye & tongue print along with their finger print.",
  "Jimmy Carter was the first U.S. President to be born in a hospital.",
  "Sex is biochemically no different from eating large quantities of chocolate.",
  "Meteorologists claim they're right 85% of the time (think about that one!)",
  "The longest recorded flight of a chicken is thirteen seconds.",
  "On an American one-dollar bill, there is an owl in the upper left-hand corner of the '1'encased in the 'shield' and a spider hidden in the front upper right-hand corner.",
  "Shakespeare invented the word 'assassination' and 'bump'.",
  "A pregnant goldfish is called a twit.",
  "Facetious and abstemious contain all the vowels in the correct order, as does arsenious, meaning 'containing arsenic'.",
  "A standard slinky measures 87 feet when stretched out.",
  "There are 318,979,564,000 possible combinations of the first four moves in Chess.",
  "If you go blind in one eye you only lose about one fifth of your vision but all your sense of depth.",
  "Porcupines can float in water.",
  "Some lions mate over 50 times a day.",
  "Owls are one of the only birds who can see the color blue!",
  "Two-thirds of the world's eggplant is grown in New Jersey.",
  "An ostrich’s eye is bigger than its brain.",
  "A mole can dig a tunnel 300 feet (91 m) long in just one night.",
  "You're born with 300 bones, but by the time you become an adult, you only have 206.",
  "On average, people fear spiders more than they do death.",
  "The serial number of the first MAC ever produced was 2001.",
  "The past-tense of the English word “dare” is “durst”",
  "Most American car horns honk in the key of F.",
  "Columbia University is the second largest landowner in New York City, after the Catholic Church.",
  "On average, Americans eat 18 acres of pizza everyday.",
  "In the marriage ceremony of the ancient Inca Indians of Peru, the couple was considered officially wed when they took off their sandals and handed them to each other.",
  "Women manage the money and pay the bills in 75% of all Americans households.",
  "The average human will shed 40 pounds of skin in a lifetime.",
  "'Evaluation and Parameterization of Stability and Safety Performance Characteristics of Two and Three Wheeled Vehicular Toys for Riding'. Title of a $230,000 research project proposed by the Department of Health, Education and Welfare, to study the various ways children fall off bicycles.",
  "California consumes more bottled water than any other product.",
  "The average human head weighs about 8 pounds.",
  "A pig's orgasm lasts for 30 minutes.",
  "A dime has 118 ridges around the edge. A quarter has 119.",
  "Americans on average eat 18 acres of pizza every day.",
  "No matter where you stand in Michigan, you are never more than 85 miles from a Great Lake.",
  "Alfred Hitchcock didn't have a belly button. It was eliminated when he was sewn up after surgery.",
  "Adolf Hitler was a vegetarian, and had only ONE testicle.",
  "In every episode of “Seinfeld” there is a Superman picture or reference somewhere.",
  "Blondes have more hair than dark-haired people do.",
  "Only 6 people in the whole world have died from moshing.",
  "A horse can look forward with one eye and back with the other.",
  "Nevada is the driest state in the U.S.. Each year it averages 7.5 inches (19 cm) of rain.",
  "A full-loaded supertanker traveling at normal speed takes at least 20 minutes to stop.",
  "One in every 4 Americans has appeared on television.",
  "The human heart creates enough pressure when it pumps out to the body to squirt blood 30 feet.",
  "It takes about 142.18 licks to reach the center of a Tootsie pop.",
  "Every time you lick a stamp, you consume 1/10 of a calorie.",
  "Mercury is the only planet whose orbit is coplanar with its equator.",
  "Most lipstick contains fish scales!",
  "'Rhythm' is the longest English word without a vowel.",
  "Mozart wrote the nursery rhyme 'twinkle, twinkle, little star' at the age of 5.",
  "One in ten people live on an island.",
  "1 in 8 Americans has worked at a McDonalds restaurant.",
  "In Raiders of the Lost Ark there is a wall carving of R2-D2 and C-3P0 behind the ark",
  "The glue on Israeli postage is certified kosher.",
  "It has NEVER rained in Calama, a town in the Atacama Desert of Chile.",
  "The dot over the letter “i” is called a tittle.",
  "You can be fined up to $1,000 for whistling on Sunday in Salt Lake City, Utah.",
  "If you were to take a taxicab from New York City to Los Angeles, it would cost you $8,325.",
  "On average a hedgehog's heart beats 300 times a minute.",
  "Walt Disney holds the world record for the most Academy Awards won by one person, he has won twenty statuettes, and twelve other plaques and certificates",
  "“Ithyphallophobia' is a morbid fear of seeing, thinking about or having an erect penis.",
  "A female ferret will die if it goes into heat and cannot find a mate.",
  "The odds of being born male are about 51.2%, according to census.",
  "Salt Lake City, Utah has a law against carrying an unwrapped ukulele on the street.",
  "Cats have over one hundred vocal sounds, while dogs only have about ten.",
  "Camels have three eyelids to protect themselves from blowing sand.",
  "Dueling is legal in Paraguay as long as both parties are registered blood donors.",
  "Tom Sawyer was the first novel written on a typewriter.",
  "Respiratory Disease is China's leading cause of death.",
  "William Marston engineered one of the earliest forms of the polygraph in the early 1900's. Later he went on to create the comic strip Wonder Woman, a story about a displaced Amazon princess who forces anyone caught in her magic lasso to tell the truth",
  "Residents of Houston, Texas lead the U.S. in eating out - approximately 4.6 times per week.",
  "A man named Charles Osborne had the hiccups for 69 years!",
  "If the population of China walked past you in single file, the line would never end because of the rate of reproduction.",
  "In ancient Rome, when a man testified in court he would swear on his testicles.",
  "Until 1994, world maps and globes sold in Albania only had Albania on them.",
  "The six official languages of the U.N. are: English, French, Arabic, Chinese, Russian and Spanish.",
  "Proportional to their size, cats have the largest eyes of all mammals.",
  "If one spells out numbers, they would have to count to One Thousand before coming across the letter 'A'.",
  "The word 'set' has more definitions than any other word in the English language.",
  "Someone paid $14,000 for the bra worn by Marilyn Monroe in the film 'Some Like It Hot'.",
  "If you went out into space, you would explode before you suffocated because there's no air pressure.",
  "Right handed people live, on average, nine years longer than left-handed people",
  "There are 1,575 steps from the ground floor to the top of the Empire State building.",
  "One third of all cancers are sun related.",
  "Venus and Uranus are the only planets that rotate opposite to the direction of their orbit.",
  "40% of McDonald’s profits come from the sales of Happy Meals.",
  "On average, 12 newborns will be given to the wrong parents daily.",
  "The first CD pressed in the US was Bruce Springsteen's 'Born in the USA'.",
  "When the University of Nebraska Cornhuskers play football at home, the stadium becomes the state's third largest city.",
  "Beetles taste like apples, wasps like pine nuts, and worms like fried bacon.",
  "The human heart creates enough pressure to squirt blood 30ft.",
  "A dragonfly has a lifespan of 24 hours.",
  "In “Silence of the Lambs”, Hannibal Lector (Anthony Hopkins) never blinks.",
  "When possums are playing 'possum', they are not 'playing'. They actually pass out from sheer terror.",
  "“Duff” is the decaying organic matter found on a forest floor.",
  "28% of Africa is classified as wilderness. In North America, its 38%.",
  "Samuel Clemens (Mark Twain) was born on and died on days when Halley’s Comet can be seen.",
  "In Italy, 17 is considered an unlucky number. In Japan, 4 is considered an unlucky number.",
  "Butterflies taste with their feet.",
  "The first contraceptive was crocodile dung used by the ancient Egyptians.",
  "Pearls melt in vinegar.",
  "Ten percent of the Russian government's income comes from the sale of vodka.",
  "Sugar was first added to chewing gum in 1869 by a dentist, William Semple.",
  "Babies are most likely to be born on Tuesdays.",
  "Nepal is the only country that doesn’t have a rectangular flag.",
  "In Miconesia, coins are 12 feet across.",
  "The mask worn by Michael Myers in the original 'Halloween' was actually a Captain Kirk mask painted white.",
  "400-quarter pounders can be made from 1 cow.",
  "By raising your legs slowly and lying on your back, you cannot sink into quicksand.",
  "Children grow faster in the springtime.",
  "Honey is the only food which does not spoil.",
  "Some worms will eat themselves if they can't find any food!",
  "The earth weighs around 6,588,000,000,000,000,000,000,000,000 tons.",
  "A man's beard grows fastest when he anticipates sex.",
  "Eskimos have over 15 words for the English word of 'Snow'",
  "Donald Duck's middle name is Fauntleroy.",
  "One in every 9000 people is an albino.",
  "The following sentence: 'A rough-coated, dough-faced, thoughtful ploughman strode through the streets of Scarborough; after falling into a slough, he coughed and hiccoughed'. Contains the nine different pronunciations of 'ough' in the English Language.",
  "Honeybees have a type of hair on their eyes!",
  "Peanuts are one of the ingredients of dynamite.",
  "Winston Churchill was born in a ladies room during a dance.",
  "In 10 minutes, a hurricane releases more energy than all of the world's nuclear weapons combined.",
  "THE MOST UNUSUAL CANNONBALL: On two occasions, Miss 'Rita Thunderbird' remained inside the cannon despite a lot of gunpowder encouragement to do otherwise. She performed in a gold lamé bikini and on one of the two occasions (1977) Miss Thunderbird remained lodged in the cannon, while her bra was shot across the Thames River.",
  "In the 1980's American migraines increased by 60%.",
  "The only capital letter in the Roman alphabet with exactly one end point is P.",
  "Starfish haven't got brains.",
  "166,875,000,000 pieces of mail are delivered each year in the US",
  "Human thigh bones are stronger than concrete.",
  "Hershey's Kisses are called that because the machine that makes them looks like it's kissing the conveyor belt.",
  "Blueberry Jelly Bellies were created especially for Ronald Reagan.",
  "The average person will accidentally eat just under a pound of insects every year.",
  "The youngest pope ever was 11 years old.",
  "Johnny Appleseed planted apples so that people could use apple cider to make alcohol.",
  "The ZIP in “ZIP code” means Zoning Improvement Plan.",
  "Los Angeles’ full name is “El Pueblo de Nuestra Senora la Reina de los Angeles de Porciuncula”.",
  "Table tennis balls have been known to travel off the paddle at speeds up to 160 km/hr.",
  "There are 45 miles of nerves in the skin of a human being.",
  "It takes the stomach an hour to break down cows’ milk.",
  "Bats always turn left when exiting a cave",
  "Most lipstick contains fish scales.",
  "Napoleon's penis was sold to an American Urologist for $40,000.",
  "The “spot” on the 7-Up logo comes from its inventor who had red eyes. He was an albino.",
  "Lightning strikes the earth about 8 million times a day.",
  "The world record for spitting a watermelon seed is 65 feet 4 inches.",
  "Greece's national anthem has 158 verses.",
  "When sharks take a bite, their eyes roll back and their teeth jut out.",
  "Former basketball superstar Michael Jordan is the most recognized face in the world, more than the pope himself.",
  "Koalas never drink water. They get fluids from the eucalyptus leaves they eat.",
  "111,111,111 x 111,111,111 = 12,345,678,987,654,321",
  "Each of us generates about 3.5 pounds of rubbish a day, most of it paper.",
  "In golf, a ‘Bo Derek’ is a score of 10.",
  "In 1986 Congress & President Ronald Reagan signed Public Law 99-359, which changed Daylight Saving Time from the last Sunday in April to the first Sunday in April. It was estimated to save the nation about 300,000 barrels of oil each year by adding most of the month April to D.S.T.",
  "$203,000,000 is spent on barbed wire each year in the U.S.",
  "The flea can jump 350 times its body length. It's like a human jumping the length of a football field.",
  "The penguin is the only bird that can’t fly but can swim.",
  "About 500 movies are made in the US and 800 in India annually.",
  "Rodent's teeth never stop growing.",
  "Hawaii is the only coffee producing state.",
  "In France, a five year old child can buy an alcoholic drink in a bar",
  "Hair is made from the same substance as fingernails.",
  "More than 90% of the Nicaraguan people are Roman Catholic.",
  "One in fourteen women in America is a natural blonde. Only one in sixteen men is.",
  "Every time you lick a stamp you consume 1/10 of a calorie.",
  "Marilyn Monroe had six toes.",
  "The average raindrop falls at 7 miles per hour.",
  "Tina Turner's real name is Annie Mae Bullock.",
  "A shrimp’s heart is in its head.",
  "There is a city in Norway called 'Hell'",
  "Vatican City is the smallest country in the world, with a population of 1000 and just 108.7 acres.",
  "The dot over the letter 'i' is called a tittle.",
  "The strongest muscle (Relative to size) in the body is the tongue.",
  "Arnold Schonberg suffered from triskaidecaphobia, the fear of the number 13. He died at 13 minutes from midnight on Friday the 13th.",
  "The NY phone book had 22 Hitlers before WWII. The NY phone book had 0 Hitlers after WWII.",
  "The cruise liner Queen Elizabeth II moves only six inches for each gallon of diesel that it burns.",
  "More people are killed annually by donkeys than airplane crashes.",
  "“The sixth sick sheik’s sixth sheep’s sick” is said to be the toughest tongue twister in English.",
  "Humans use a total of 72 different muscles in speech.",
  "The town of Calma, Chile in the Atacama Desert has never had rain.",
  "It's possible to lead a cow upstairs but not downstairs.",
  "Nearly 80% of all animals on earth have six legs.",
  "CBS' '60 Minutes' is the only TV show without a theme song/music.",
  "Larry Lewis ran the 100-yard dash in 17.8 seconds in 1969, thereby setting a new world's record for runners in the 100-years-or-older class. He was 101.",
  "Giraffes and rats can last longer without water than camels.",
  "There is a seven letter word in the English language that contains ten words without rearranging any of its letters, 'therein': the, there, he, in, rein, her, here, ere, therein, herein.",
  "Mel Blanc (the voice of Bugs Bunny) was allergic to carrots.",
  "Chameleons can move their eyes in two directions at the same time.",
  "Average number of days a West German goes without washing his underwear: 7",
  "The KGB is headquartered at No. 2 Felix Dzerzhinsky Square, Moscow",
  "A chameleon's tongue is twice the length of its body.",
  "In a survey of 200000 ostriches over 80 years, not one tried to bury its head in the sand.",
  "The amount of computer Memory required to run WordPerfect for Win95 is 8 times the amount needed aboard the space shuttle.",
  "Lee Harvey Oswald's cadaver tag sold at an auction for $6,600 in 1992.",
  "A family of 26 could go to the movies in Mexico city for the price of one in Tokyo.",
  "South Dakota is the only U.S state which shares no letters with the name of it's capital",
  "There is an average of 61,000 people airborne over the US at any given moment.",
  "In most advertisements, including newspapers, the time displayed on a watch is 10:10.",
  "The pupils of a goat's eyes are square.",
  "The most common name in Italy is Mario Rossi.",
  "Jupiter is bigger than all the other planets in our solar system combined.",
  "Most dust particles in your house are made from dead skin!",
  "You were born with 300 bones, but by the time you are an adult you will only have 206.",
  "Cher's last name was 'Sarkissian'. She changed it because no one could pronounce it.",
  "The buzz from an electric razor in America plays in the key of B flat; Key of G in England.",
  "Your stomach needs to produce a new layer of mucus every two weeks or it would digest itself.",
  "During his entire life, Vincent Van Gogh sold exactly one painting, “Red Vineyard at Arles”.",
  "Truck driving is the most dangerous occupation by accidental deaths (799 in 2001).",
  "If one places a tiny amount of liquor on a scorpion, it will instantly go mad and sting itself to death.",
  "The phrase 'rule of thumb' is derived from an old English law, which stated that you couldn't beat your wife with anything wider than your thumb.",
  "There is a hotel in Sweden built entirely out of ice; it is rebuilt every year.",
  "Coca-Cola contained Coca (whose active ingredient is cocaine) from 1885 to 1903.",
  "In 1980, a Las Vegas hospital suspended workers for betting on when patients would die.",
  "Cats urine glows under a black light.",
  "Dolphins can look in different directions with each eye. They can sleep with one eye open.",
  "Shakespeare is quoted 33,150 times in the Oxford English dictionary.",
  "The first song played on Armed Forces Radio during operation Desert Shield was 'Rock the Casba' by the Clash.",
  "Los Angeles' full name 'El Pueblo de Nuestra Senora la Reina de Los Angeles de Porciuncula' is reduced to 3.63% of its size in the abbreviation 'L.A'..",
  "Firehouses have circular stairways originating from the old days when the engines were pulled by horses. The horses were stabled on the ground floor and figured out how to walk up straight staircases.",
  "Statues in parks: If the horse has both front legs in the air, the person died in battle; if the horse has one front leg in the air, the person died as a result of wounds received in battle; if the horse has all four legs on the ground, the person died of natural causes.",
  "The average human blinks their eyes 6,205,000 times each year.",
  "The cheetah is the only cat that can't retract its claws.",
  "The word “lethologica” describes the state of not being able to remember the word you want.",
  "The katydid bug hears through holes in its hind legs!",
  "Over 1000 birds a year die from smashing into windows!",
  "It was discovered on a space mission that a frog can throw up. The frog throws up its stomach first, so the stomach is dangling out of its mouth. Then the frog uses its forearms to dig out all of the stomach's contents and then swallows the stomach back down.",
  "The average chocolate bar has 8 insects' legs in it.",
  "There are two credit cards for every person in the United States.",
  "Sherlock Holmes NEVER said “Elementary, my dear Watson”",
  "The average woman consumes 6 lbs of lipstick in her lifetime.",
  "There are 240 dots on an arcade Pac-Man game",
  "Crocodiles and alligators are surprisingly fast on land. Although they are rapid, they are not agile. So, if being chased by one, run in a zigzag line to lose him or her.",
  "Lizards can self-amputate their tails for protection. It grows back after a few months.",
  "The original story from 'Tales of 1001 Arabian Nights' begins, 'Aladdin was a little Chinese boy'.",
  "5,840 people with pillow related injuries checked into U.S. emergency rooms in 1992.",
  "If you put a drop of liquor on a scorpion, it will instantly go mad and sting itself to death.",
  "Mike Nesmith's (the guitarist of The Monkeys) mom invented White Out.",
  "“Canada” is an Indian word meaning “Big Village”.",
  "Al Capone's business card said he was a used furniture dealer.",
  "Orville Wright was involved in the first aircraft accident. His passenger, a Frenchman, was killed.",
  "Prince Charles is an avid collecter of toilet seats.",
  "China has more English speakers than the United States.",
  "Abraham Lincoln’s ghost is said to haunt the White House.",
  "The world's record for keeping a Lifesaver in the mouth with the hole intact is 7 hrs 10 min.",
  "About 200,000,000 M&Ms are sold each day in the United States.",
  "Greenland is the largest island in the world.",
  "Russians generally answer the phone by saying, 'I'm listening'.",
  "When the Titanic sank, 2228 people were on it. Only 706 survived.",
  "Almonds are a member of the peach family.",
  "The human heart creates enough pressure in the bloodstream to squirt blood 30 feet.",
  "Hummingbirds are the only animals that can fly backwards.",
  "The shortest war in history was between Zanzibar and England in 1896. Zanzibar surrendered after 38 minutes.",
  "In the White House, there are 13,092 knives, forks and spoons!",
  "King Louis XIX ruled France for 15 minutes.",
  "Chocolate can kill dogs; it directly affects their heart and nervous system.",
  "Golf courses cover 4% of North America.",
  "When we think of Big Ben in London, we think of the clock. Actually, it's the bell.",
  "A snail can sleep for three years.",
  "The cruise liner, Queen Elizabeth II, moves only six inches for each gallon of diesel that it burns.",
  "The most common name in world is Mohammed.",
  "The Main Library at Indiana University sinks over an inch every year because when it was built, engineers failed to take into account the weight of all the books that would occupy the building.",
  "In 1778, fashionable women of Paris never went out in blustery weather without a lightning rod attached to their hats.",
  "A literal translation of a standard traffic sign in China: 'Give large space to the festive dog that makes sport in the roadway'.",
  "Alabama was the first state to recognize Christmas as an official holiday.",
  "Every time you lick a stamp, you're consuming 1/10 of a calorie.",
  "The most sensitive cluster of nerves is at the base of the spine.",
  "98% of Japanese are cremated.",
  "Mr. Rogers is an ordained minister.",
  "Most household dust is made of dead skin cells.",
  "The placement of a donkey's eyes in its' heads enables it to see all four feet at all times!",
  "The longest word comprised of one row on the keyboard is: TYPEWRITER",
  "3.9% of all women do not wear underwear.",
  "Approximately every seven minutes of every day, someone in an aerobics class pulls their hamstring.",
  "There are only four words in the English language which end in 'dous': tremendous, horrendous, stupendous, and hazardous.",
  "Scotland has more redheads than any other part of the world.",
  "Almonds are members of the peach family.",
  "The only two days of the year in which there are no professional sports games--MLB, NBA, NHL, or NFL--are the day before and the day after the Major League All-Star Game.",
  "Czechs are the biggest consumers of beer per male in the world.",
  "Kuwait is about 60% male (highest in the world). Latvia is about 54% female (highest in the world).",
  "The US has more personal computers than the next 7 countries combined.",
  "During a severe windstorm or rainstorm the Empire State Building sways several feet to either side.",
  "Paraskevidekatriaphobia means fear of Friday the 13th, which occurs one to three times a year.",
  "The state of Florida is bigger than England!",
  "When the French Academy was preparing its first dictionary, it defined 'crab' as, 'A small red fish, which walks backwards'. This definition was sent with a number of others to the naturalist Cuvier for his approval. The scientist wrote back, 'Your definition, gentlemen, would be perfect, only for three exceptions. The crab is not a fish, it is not red and it does not walk backwards'.",
  "The penguin is the only bird that can swim but can't fly.",
  "Coca-Cola was originally green.",
  "Our eyes are always the same size from birth but our nose and ears never stop growing.",
  "Yo-yos were used as weapons by warriors in the Philippines in the 16th century.",
  "It is illegal to hunt camels in the state of Arizona.",
  "The word “maverick” came into use after Samuel Maverick, a Texan refused to brand his cattle.",
  "The average child recognizes over 200 company logos by the time he enters first grade.",
  "Leonardo da Vinci could write with one hand while drawing with the other",
  "Slugs have four noses.",
  "For every 'normal' webpage, there are five porn pages.",
  "Most dust particles in your house are made from dead skin.",
  "The average person laughs 10 times a day!",
  "Laredo, Texas is the U.S'.s farthest inland port.",
  "Barbie's measurements, if she were life-size, would be 39-29-33.",
  "The first McDonald's restaurant in Canada was in Richmond, British Columbia.",
  "Albert Einstein and Charles Darwin both married their first cousins",
  "Rats and horses can’t vomit.",
  "Paper was invented early in the second century by Chinese eunuch.",
  "The toothbrush was invented in China in 1498.",
  "Babies are born without kneecaps. They don't appear until the child reaches 2-6 years of age.",
  "On average, Americans' favorite smell is banana.",
  "Spain leads the world in cork production",
  "It has been estimated that humans use only 10% of their brain.",
  "Annual growth of WWW traffic is 314,000%",
  "In a test performed by Canadian scientists, using various different styles of music, it was determined that chickens lay the most eggs when pop music was played.",
  "Netherlands is the only country with a national dog.",
  "Since 1978, 37 people have died by Vending Machine's falling on them. 13 people are killed annually. All this while trying to shake merchandise out of them. 113 people have been injured.",
  "It is illegal to eat oranges while bathing in California.",
  "The Simpsons is the longest running animated series on TV.",
  "On average, 100 people choke to death on ball-point pens every year.",
  "Hot water is heavier than cold.",
  "The three most recognized Western names in China are Jesus Christ, Richard Nixon, & Elvis Presley.",
  "Relative to size, the strongest muscle in the body is the tongue.",
  "In 1984, a Canadian farmer began renting advertising space on his cows.",
  "The strongest muscle in the human body is the tongue. (the heart is not a muscle)",
  "Stephen Hawking was born exactly 300 years after Galileo died.",
  "John Adams, Thomas Jefferson, and James Monroe died on July 4th.",
  "The average talker sprays about 300 microscopic saliva droplets per minute, about 2.5 droplets per word.",
  "The number 'four' is considered unlucky in Japan because it is pronounced the same as 'death'.",
  "There are a million ants for every person on Earth.",
  "Baby robins eat 14 feet of earthworms every day",
  "An eighteenth-century German named Matthew Birchinger, known as 'the little man of Nuremberg,' played four musical instruments including the bagpipes, was an expert calligrapher, and was the most famous stage magician of his day. He performed tricks with the cup and balls that have never been explained. Yet Birchinger had no hands, legs, or thighs, and was less than 29 inches tall.",
  "A Boeing 747s wingspan is longer than the Wright brother's first flight.",
  "The Falkland Isles (pop. about 2000) has over 700000 sheep (350 per person).",
  "Ingrown toenails are hereditary.",
  "To 'testify' was based on men in the Roman court swearing to a statement made by swearing on their testicles.",
  "There are 1,792 steps in the Eiffel Tower",
  "Rugby, North Dakota is the geographical center of North America.",
  "'I am'. is the shortest complete sentence in the English language.",
  "The original name for butterfly was flutterby.",
  "Hong Kong holds the most Rolls Royce’s per capita.",
  "Owls are the only birds that can see the color blue.",
  "The country code for Russia is '007'.",
  "About 55% of all movies are rated R.",
  "The volume of the earth's moon is the same as the volume of the Pacific Ocean.",
  "Honey is the only food that does not spoil.",
  "A blue whales heart only beats nine times per minute.",
  "38% of American men say they love their cars more than women",
  "It takes 3,000 cows to supply the NFL with enough leather for a year's supply of footballs.",
  "Jim Morrison, of the 60's rock group The Doors, was the first rock star to be arrested on stage.",
  "The male seahorse carries the eggs until they hatch instead of the female.",
  "One out of every 43 prisoners escapes from jail. 94% are recaptured.",
  "Butte County, South Dakota is the geographical center of the U.S.",
  "60% of electrocutions occur while talking on the telephone during a thunderstorm.",
  "Every US president has worn glasses (just not always in public).",
  "Only one person in two billion will live to be 116 or older.",
  "Donald Duck comics were banned from Finland because he doesn't wear pants!",
  "In 1933, Mickey Mouse, an animated cartoon character, received 800,000 fan letters.",
  "In the United States, a pound of potato chips costs two hundred times more than a pound of potatoes.",
  "The average American looks at eight houses before buying one.",
  "The first CD pressed in the US was Bruce Springsteen’s “Born in the USA”.",
  "You can sail all the way around the world at latitude 60 degrees south.",
  "The pop you hear when you crack your knuckles is actually a bubble of gas burning.",
  "There's a systematic lull in conversation every 7 minutes.",
  "Wyoming was the first state to give women the right to vote in 1869.",
  "2,000 pounds of space dust and other space debris fall on the Earth every day.",
  "Lawn darts are illegal in Canada.",
  "In Iceland, a Big Mac costs $5.50.",
  "The name Wendy was made up for the book 'Peter Pan'.",
  "You can't kill yourself by holding your breath",
  "Americans on the average eat 18 acres of pizza every day.",
  "The surface of the Earth is about 60% water and 10% ice.",
  "There are approximately 100 million acts of sexual intercourse each day.",
  "You share your birthday with at least 9 million other people in the world.",
  "The city of Venice stands on about 120 small islands.",
  "The first bomb the Allies dropped on Berlin in WWII killed the only elephant in the Berlin Zoo.",
  "A “2 by 4' is really 1 1/2 by 3 1/2.",
  "A piece of paper can be folded no more then 9 times.",
  "Honey is the only natural food that is made without destroying any kind of life.",
  "Hedenophobic means fear of pleasure.",
  "The longest word in the English language, according to the Oxford English Dictionary, is: pneumonoultramicroscopicsilicovolcanoconiosis..",
  "1 in every 4 Americans has appeared someway or another on television.",
  "Cats have over 100 vocal sounds; dogs only have 10.",
  "The king of hearts is the only king without a mustache.",
  "In the 17th century, the value of pi was known to 35 decimal places. Today, to 1.2411 trillion.",
  "An Olympic gold medal must contain 92.5 percent silver",
  "The ant always falls over on its right side when intoxicated.",
  "'Dreamt' is the only English word that ends in the letters 'mt'.",
  "Leonardo Da Vinci invented the scissors.",
  "The average cough comes out of your mouth at 60 miles (96.5 km) per hour.",
  "A B-25 bomber crashed into the 79th floor of the Empire State Building on July 28, 1945.",
  "The site with the highest number of women visitors between the age of 35 and 44 years old: Alka-Seltzer.com",
  "The people of Israel consume more turkeys per capita than any other country.",
  "One quarter of the bones in your body are in your feet.",
  "Your stomach produces a new layer of mucus every two weeks so that it doesn’t digest itself.",
  "'Stewardesses' is the longest word typed with only the left hand.",
  "The crack of a whip is actually a tiny sonic boom, since the tip breaks the sound barrier.",
  "Each year there is one ton of cement poured for each man woman and child in the world.",
  "The Human eyes never grow, but nose and ears never stop growing.",
  "US gold coins used to say “In Gold We Trust”.",
  "One-fourth of the world's population lives on less than $200 a year. Ninety million people survive on less than $75 a year.",
  "The sweat drops drawn in cartoon comic strips are called pleuts.",
  "Virginia Woolf wrote all her books standing.",
  "Seattle’s Fremont Bridge rises up and down more than any drawbridge in the world.",
  "It costs more to buy a new car today in the United States than it cost Christopher Columbus to equip and undertake three voyages to and from the New World.",
  "Arabic numerals are not really Arabic; they were created in India.",
  "Americans are responsible for about 1/5 of the world’s garbage annually.",
  "In the average lifetime, a person will walk the equivalent of 5 times around the equator.",
  "In the great fire of London in 1666 half of London was burnt down but only 6 people were injured.",
  "It's impossible to sneeze with your eyes open.",
  "Rats multiply so quickly that in 18 months, two rats could have over million descendants.",
  "Sherlock Holmes NEVER said, 'Elementary, my dear Watson'.",
  "The characters Bert and Ernie on Sesame Street were named after Bert the cop and Ernie the taxi driver in Frank Capra's 'Its A Wonderful Life'.",
  "There is actually no danger in swimming right after you eat, though it may feel uncomfortable.",
  "Between 25% and 33% of the population sneeze when exposed to light.",
  "Grapes explode when you put them in the microwave. Go on, try it then",
  "'Almost' is the longest word in the English language with all the letters in alphabetical order.",
  "A Boeing 747's wingspan is longer than the Wright brother's first flight.",
  "13% of Americans actually believe that some parts of the moon are made of cheese.",
  "The shortest British monarch was Charles I, who was 4 feet 9 inches.",
  "PEZ candy even comes in a Coffee flavor.",
  "Kelsey Grammar sings and plays the piano for the theme song of Fraiser.",
  "Cats have over one hundred vocal sounds; dogs only have about ten.",
  "Half the foods eaten throughout the world today were developed by farmers in the Andes Mountains (including potatoes, maize, sweet potatoes, squash, all varieties of beans, peanuts, manioc, papayas, strawberries, mulberries and many others).",
  "Shakespeare spelled his OWN name several different ways.",
  "A snail can sleep for 3 years.",
  "To Ensure Promptness, one is expected to pay beyond the value of service – hence the later abbreviation: T.I.P.",
  "Switzerland is the only country with a square flag.",
  "They NEVER said “Beam me up, Scotty” on Star Trek.",
  "Cats’ urine glows under a black light.",
  "The sperm of a mouse is actually longer than the sperm of an elephant.",
  "Elvis had a twin brother named Garon, who died at birth, which is why Elvis middle name was Aron.",
  "Arizona was the last of the 48 adjoining continental states to enter the Union.",
  "An average human loses about 200 head hairs per day.",
  "Your skull is made up of 29 different bones.",
  "It's against the law to burp, or sneeze in a church in Nebraska, USA.",
  "Rhode Island is the only state which the hammer throw is a legal high school sport.",
  "More Monopoly money is printed in a year, than real money throughout the world.",
  "The “save” icon in Microsoft Office programs shows a floppy disk with the shutter on backwards.",
  "There are 336 dimples on a regulation golf ball.",
  "Elephants are the only mammals that cannot jump.",
  "A whale's penis is called a dork.",
  "On average people fear spiders more than they do death.",
  "During the chariot scene in 'Ben Hur,' a small red car can be seen in the distance.",
  "The average person falls asleep in seven minutes.",
  "A shark can detect one part of blood in 100 million parts of water.",
  "Women blink nearly twice as much as men.",
  "Mongolia is the largest landlocked country.",
  "The Guinness Book of Records holds the record for being the book most often stolen from Libraries.",
  "The Minneapolis phone book has 21 pages of Andersons.",
  "The average chocolate bar has 8 insects’ legs melted into it.",
  "The male gypsy moth can 'smell' the virgin female gypsy moth from 1.8 miles away.",
  "The official beverage of Ohio is tomato juice.",
  "The national anthem of Greece has 158 verses.",
  "John Wilkes Booth’s brother once saved the life of Abraham Lincoln’s son.",
  "Buckingham Palace has 602 rooms.",
  "The skeleton of Jeremy Bentham is present at all important meetings of the University of London",
  "The Black Death reduced the population of Europe by one third in the period from 1347 to 1351.",
  "Only female mosquito’s' bite and most are attracted to the color blue twice as much as to any other color.",
  "70% of all boats sold are used for fishing.",
  "A pound of houseflies contains more protein than a pound of beef",
  "It's against the law to doze off under a hair dryer in Florida/against the law to slap an old friend on the back in Georgia/against the law to Play hopscotch on a Sunday in Missouri.",
  "NBA superstar Michael Jordan was originally cut from his high school basketball team.",
  "What is called a 'French kiss' in the English speaking world is known as an 'English kiss' in France.",
  "Georgia's state motto is 'Wisdom, Justice and Moderation'.",
  "No word in the English language rhymes with 'MONTH'.",
  "Daffy Duck's middle name is 'Dumas'",
  "Pepsi originally contained pepsin, thus the name.",
  "In York, it is perfectly legal to shoot a Scotsman with a bow and arrow (except on Sundays)",
  "'Venus observa' is the technical term for the 'missionary position'.",
  "In 1912 a law passed in Nebraska where drivers in the country at night were required to stop every 150 yards, send up a skyrocket, wait eight minutes for the road to clear before proceeding cautiously, all the while blowing their horn and shooting off flares.",
  "February 1865 is the only month in recorded history not to have a full moon.",
  "Dentists have recommended that a toothbrush be kept at least 6 feet away from a toilet to avoid airborne particles resulting from the flush.",
  "More people are allergic to cow's milk than any other food.",
  "Nepal is the only country that has a non-rectangular flag. It is also asymmetrical.",
  "Prince Charles and Prince William never travel on the same airplane in case there is a crash.",
  "The fingerprints of koala bears are virtually indistinguishable from those of humans, so much so that they can be easily confused at a crime scene.",
  "In the U.S, Frisbees outsell footballs, baseballs and basketballs combined.",
  "Average life span of a major league baseball: 7 pitches.",
  "Humans are the only primates that don't have pigment in the palms of their hands.",
  "Mosquito repellents don't repel. They hide you. The spray blocks the mosquito's sensors so they don't know you're there.",
  "The Bible, the world's best-selling book, is also the world's most shoplifted book.",
  "98% of all murders and rapes are by a close family member or friend of the victim.",
  "All polar bears are left-handed.",
  "A rainbow can be seen only in the morning or late afternoon. It can occur only when the sun is 40 degrees or less above the horizon.",
  "Coconuts kill about 150 people each year. That’s more than sharks.",
  "Mount Olympus Mons on Mars is three times the size of Mount Everest.",
  "Non-dairy creamer is flammable.",
  "Michigan was the first state to have roadside picnic tables.",
  "Any free-moving liquid in outer space will form itself into a sphere, because of its surface tension.",
  "In Bangladesh, kids as young as 15 can be jailed for cheating on their finals!",
  "The highest point in Pennsylvania is lower than the lowest point in Colorado.",
  "Louisiana's capital building is the tallest one of any U.S. state.",
  "Tasmania, Australia has the cleanest air in the inhabited world.",
  "Broccoli and cauliflower are the only vegetables that are flowers.",
  "3.6 cans of Spam are consumed each second.",
  "The first license plate on a car in the United States was issued in Denver, Colorado in 1908.",
  "There are over 58 million dogs in the US",
  "The first CD pressed in the US was Bruce Springsteen's 'Born in the USA'",
  "Iceland consumes more Coca-Cola per capita than any other nation.",
  "Your heart beats over 100,000 times a day!",
  "Researchers at the Texas Department of Highways in Fort Worth determined the cow population of the U.S. burps some 50 million tons of valuable hydrocarbons into the atmosphere each year. The accumulated burps of ten average cows could keep a small house adequately heated and its stove operating for a year.",
  "The average human brain has about 100 billion nerve cells.",
  "Peter Falk, who played 'Columbo,' has a glass eye.",
  "The average life of a taste bud is 10 days.",
  "Montpelier, Vermont is the only state capital without a McDonalds.",
  "This common everyday occurrence composed of 59% nitrogen, 21% hydrogen, and 9% dioxide is called a 'fart'.",
  "To escape the grip of a crocodile's jaws, push your thumbs into its eyeballs - it will let you go instantly.",
  "Telly Savalas and Louis Armstrong died on their birthdays.",
  "An ant always falls over on its right side when intoxicated.",
  "The first episode of 'Joanie Loves Chachi' was the highest rated American program in the history of Korean television, a country where 'Chachi' translates to 'penis'.",
  "American Airlines saved $40,000 in 1987 by taking out an olive from First Class salads.",
  "Buckingham Palace in England has over six hundred rooms.",
  "Canada is the only country not to win a gold medal in the summer Olympic games while hosting.",
  "Bruce Lee was so fast that they actually had to s-l-o-w film down so you could see his moves.",
  "Elephants only sleep for two hours each day.",
  "Sailfish can leap out of the water and into the air at a speed of 50 miles (81 km) per hour.",
  "There is a 1 in 4 chance that New York will have a white Christmas.",
  "There is a city called Rome on every continent.",
  "Butterflies taste with their hind feet.",
  "The giant red star Betelgeuse has a diameter larger than that of the Earth's orbit around the sun.",
  "The 'pound' key on your keyboard (#) is called an octotroph.",
  "For every 230 cars that are made, 1 will be stolen.",
  "In the early 1940s, the FCC assigned television's Channel 1 to mobile services (like two-way radios in taxis) but did not re-number the other channel assignments.",
  "Ketchup was sold in the 1830s as medicine.",
  "If a rooster can't fully extend its neck, it can't crow.",
  "The first product to have a bar code was Wrigley’s gum.",
  "The human brain uses the same amount of energy as a 10-watt light bulb",
  "The average person spends about two years on the phone in a lifetime.",
  "The first owner of the Marlboro company died of lung cancer.",
  "The Michelin man is known as Mr. Bib. His name was Bibendum in the company’s first ads in 1896.",
  "A lion's roar can be heard from five miles away.",
  "A dime has 118 ridges around the edge.",
  "Cephalacaudal recapitulation is the reason our extremities develop faster than the rest of us.",
  "There are 1 million ants for every human in the world.",
  "Each king in a deck of playing cards represents a great king from history. Spades - King David, Clubs - Alexander the Great, Hearts - Charlemagne, and Diamonds - Julius Caesar.",
  "James Bond's car had three different license plates in Goldfinger",
  "A giraffe can clean its ears with its 21-inch tongue!",
  "On average, 100 people choke to death on ballpoint pens every year.",
  "The world’s oldest piece of chewing gum is 9000 years old!",
  "A bull can inseminate 300 cows from one single ejaculation.",
  "A signature is called a John Hancock because he signed the Declaration of Independence. Only 2 people signed the declaration of independence on July 4. The Last person signed 2 years later.",
  "Denver, Colorado lays claim to the invention of the cheeseburger.",
  "There are more plastic flamingos in the U.S that there are real ones.",
  "In America you will see an average of 500 advertisements a day.",
  "25% of a human’s bones are in its feet.",
  "Only female mosquitoes bite.",
  "Charlie Chaplin once won third prize in a Charlie Chaplin look-alike contest.",
  "In a lifetime the average human produces enough quarts of spit to fill 2 swimming pools.",
  "Pamela Anderson Lee is Canada's Centennial Baby, being the first baby born on the centennial anniversary of Canada's independence.",
  "Sex burns 360 calories per hour.",
  "Tigers not only have striped fur, they have striped skin!",
  "55.1% of all US prisoners are in prison for drug offenses.",
  "The catfish has over 27000 taste buds (more than any other animal)",
  "Eating the heart of a male Partridge was the cure for impotence in ancient Babylon.",
  "The shape of plant collenchyma’s cells and the shape of the bubbles in beer foam are the same - they are orthotetrachidecahedrons.",
  "The largest taxi fleet in the world is found in Mexico City. The city boasts a fleet of over 60,000 taxis.",
  "A goldfish has a memory span of three seconds.",
  "More people speak English in China than the United States.",
  "Your stomach has to produce a new layer of mucus every two weeks or it will digest itself.",
  "Worcestershire sauce in essentially an Anchovy Ketchup.",
  "The U.S. Post Office handles 43 percent of the world’s mail.",
  "It is impossible to lick your elbow.",
  "A spider has transparent blood.",
  "In space, astronauts cannot cry, because there is no gravity, so the tears can't flow.",
  "The longest recorded flight  of a chicken is 13 seconds",
  "On average, 12 newborns will be given to the wrong parents every day.",
  "The 57 on the Heinz ketchup bottle represents the number of pickle types the company once had.",
  "100% of lottery winners do gain weight",
  "Icelanders consume more Coca-Cola per Capita than any other nation.",
  "Studies have shown that children laugh an average of 300 times/day and adults 17 times/day, making the average child more optimistic, curious, and creative than the adult.",
  "Average number of people airborne over the US any given hour: 61,000.",
  "If Texas were a country, its GNP would be the fifth largest of any country in the world.",
  "In Vermont, the ratio of cows to people is 10:1",
  "Isaac Asimov is the only author to have a book in every Dewey-decimal category.",
  "Between 2 and 3 jockeys are killed each year in horse racing.",
  "If we had the same mortality rate now as in 1900, more than half the people in the world today would not be alive.",
  "The first novel ever written on a typewriter is Tom Sawyer.",
  "You are more likely to be killed by a champagne cork than by a poisonous spider.",
  "Present population of 5 billion plus people of the world is predicted to become 15 billion by 2080.",
  "Valentine Tapley from Pike County, Missouri, grew chin whiskers attaining a length of twelve feet six inches from 1860 until his death 1910, protesting Abraham Lincoln's election to the presidency.",
  "Celery has negative calories! It takes more calories to eat a piece of celery than the celery has in it."
]
