[
  "Taxation *with* representation isn't so hot, either.",
  "A seminar on Time Travel will be held two weeks ago.",
  "The generation of random numbers is too important to be left to chance.",
  "Everything inspires. But one things more than others.",
  "Hard work pays off in the future. Laziness pays off now.",
  "Chess players mate better.",
  "Two heads are better than one.",
  "The trouble with doing something right the first time is that nobody appreciates how difficult is was.",
  "Everybody lies; but it doesn't matter much since nobody listens.",
  "The body of a dead enemy always smells sweet.",
  "Money can't buy happiness... but it sure makes misery a lot easier to live with.",
  "The buck doesn't even slow down here.",
  "Blessed are the meek, for they make great scapegoats.",
  "Affirmative Action is mediocrity's answer to Darwin.",
  "He who hesitates is last.",
  "No matter how much you do, you'll never do enough.",
  "All that glitters has a high refractive index.",
  "The nice thing about kleptomania is that you can take something for it.",
  "No matter what goes wrong, it will probably look right.",
  "Time flies like an arrow, but fruit flies like a banana.",
  "To iterate is human; to recurse, divine.",
  "It's an ill wind that blows no good.",
  "War doesn't determine who's right, but who's left.",
  "People who live in glass houses shouldn't throw stones.",
  "Life is cheap. It's the accessories that kill you.",
  "Time flies when you don't know what you're doing.",
  "Golf scores are directly proportional to the number of witnesses.",
  "If we don't know it already, chances are we're not interested in learning it.",
  "You can close your eyes to reality but not to memories.",
  "Elevators smell different to midgets.",
  "You can actually get anywhere in ten minutes if you go fast enough.",
  "You live and you learn. Or you don't live long.",
  "Heisenberg may have been right.",
  "There are 3 kinds of people: those who can count and those who can't.",
  "He who throws mud loses ground.",
  "The young know the rules, the old know the exceptions.",
  "You can only be young once, but you can be immature forever.",
  "Therapy helps, but screaming obscenities is cheaper.",
  "After all is said and done, usually more is said.",
  "It's not when you get up, but when you get down.",
  "Nothing is illegal until you get caught.",
  "Happiness can't buy money.",
  "Most people deserve each other.",
  "Eagles fly; but weasels aren't sucked into jet engines.",
  "The Earth is like a grain of sand, only bigger.",
  "You can't tell a book by its cover.",
  "Too many cooks spoil the broth.",
  "Nostalgia is okay but not what it used to be.",
  "Part-time musicians are semiconductors.",
  "Dates in Calendar are closer than they appear.",
  "Men are like toilets: the good ones are taken, the rest are full of shit.",
  "The employer generally gets the employees he deserves.",
  "To err and to blame someone else is human, but to really screw things up requires a computer.",
  "You're either part of the solution or part of the precipitate.",
  "Life's like raisin bran. Few raisins and lots of bran.",
  "It takes a big man to cry, but it takes a bigger man to laugh at that man.",
  "Everybody is somebody else's weirdo.",
  "It's amazing how mature wisdom resembles being too tired.",
  "Those who can't write, write manuals.",
  "Old soldiers never die. Young ones do.",
  "Street lights timed for 35 mph are also timed for 70 mph.",
  "For every problem there is a simple solution, and it's always wrong.",
  "Life is like... an analogy.",
  "To err is Human, with blondes it's mandatory.",
  "Even if you win the rat race, you're still a rat.",
  "You cannot propel yourself forward by patting yourself on the back.",
  "Talk is cheap because supply exceeds demand.",
  "To err is human, to forgive is simply not our policy.",
  "You can't be late until you show up.",
  "A man's house is his hassle.",
  "Good fences make good neighbors.",
  "The second most preposterous notion is that copulation is inherently sinful.",
  "Friends come and go but enemies accumulate.",
  "Sarcasm helps keep you from telling people what you really think of them.",
  "Hungarian food is OK if you like dog tartare.",
  "Its hard to get a \"head\" in the world...",
  "Committees do harm merely by existing.",
  "All things being equal, you lose.",
  "You never really learn to swear until you learn to drive.",
  "It's okay to laugh in the bedroom, but don't point.",
  "Winning isn't everything, but losing isn't anything.",
  "Some drink at the fountain of knowledge... others just gargle.",
  "George Washington's brother was the uncle of our country.",
  "Love is blind; marriage is the eye-opener.",
  "Anything worth doing, is worth getting someone else to do.",
  "Those who live by the sword get shot by those who don't.",
  "To be a \"proactive\" lefty in the new South Africa is to give in to the demands of the other group before they have even made those demands.",
  "Life has a lot of undocumented features.",
  "Life isn't weird; it's the people in it.",
  "While some people need friends, most people just need someone they can be better than.",
  "If we could just get everyone to close their eyes and visualize world peace for an hour, imagine how serene and quiet it would be until the looting started.",
  "Pure drivel tends to drive away ordinary drivel.",
  "The shortest distance between two points is under construction.",
  "Life is a bowl of spaghetti O's. They're all zeros, you just have to eat them up.",
  "Actions speak louder than words.",
  "You cannot teach an old dog new tricks.",
  "Absence makes the heart grow fonder.",
  "The way to a man's heart is through the left ventricle.",
  "Nothing is wrong with you that reincarnation can't cure.",
  "Open mouth, insert foot, echo internationally.",
  "Good generally conquers evil. Unless, of course, good is stupid.",
  "To join boldly infinitives which no man has joined before.",
  "In today's world, anyone who is not confused just isn't thinking straight.",
  "You know you've landed gear-up when it takes full power to taxi.",
  "You cannot achieve the impossible without attempting the absurd.",
  "No matter where you go; you're there.",
  "Life is complex. It has real and imaginary parts.",
  "Desserts spelled backwards becomes stressed.",
  "Life is like a package from the Unabomber... you never know what you're gonna get",
  "Half a loaf is better than none.",
  "The more things change, the more they stay insane.",
  "Every silver lining has a cloud.",
  "Laugh and the world laughs with you. Cry and the world laughs louder.",
  "Those who fail to understand hyperbole may lose their asymptotes.",
  "An ounce of image is worth a pound of performance.",
  "Life is too short to drink cheap beer.",
  "Nice guys don't finish nice.",
  "The bigger they are, the harder they hit.",
  "Power corrupts; absolute power corrupts absolutely.",
  "If you can survive death, you can probably survive anything.",
  "Taxes are not levied for the benefit of the taxed.",
  "Some do, some don't, some will and some won't.",
  "Two thirds of Americans can't do fractions.The other half, just doesn't care.",
  "Having a good time can be deadly.",
  "People who think they know everything are a great annoyance to those of us who do.",
  "Hard work will never break up with you.",
  "Everything changes except change.",
  "Nature abhors second order differential equations.",
  "A kind word and gun gets you more than a kind word alone.",
  "High explosives are applicable where truth and logic fail.",
  "Old age and treachery will beat youth and enthusiasm.",
  "Life is recursive.",
  "No one is perfect, but some of us are closer than others.",
  "Life is just one of those things.",
  "To err is human, to forgive is $5.00",
  "Money makes the world go around. Love just barely keeps it from blowing up.",
  "He who dies with the most of anything, is still dead.",
  "For every idiot-proof system, a new improved idiot will arise to overcome it.",
  "In life's rat race, it's not how fast you can run but how good you deal with the cats that matters.",
  "Generalizations (as a rule) are bad.",
  "Nobody ever forgets where he buried the hatchet.",
  "All Scottish cuisine is based on a dare.",
  "It's only hopeless if you walk away.",
  "A man who smiles when things go wrong knows who to blame.",
  "Complex problems have simple, easy-to-understand wrong answers.",
  "Humankind cannot bear very much reality.",
  "A bird in the hand is generally dead.",
  "In life's wallet, there's no compartment for change.",
  "Schizophrenia beats being alone.",
  "It looks like blind screaming hedonism won out.",
  "The new baby is like royalty, he's the prince of wails.",
  "What garlic is to salad, insanity is to art.",
  "The rich get richer; the poor get babies.",
  "No one is listening until you make a mistake.",
  "Your type doesn't stay around long enough to stay your type.",
  "You're only young once; you can be immature forever",
  "Good girls go to heaven. Bad girls go everywhere.",
  "Money can't buy happiness, but allows a choice of misery.",
  "Out of sight, out of mind.",
  "To err is human, and stupid.",
  "Where subtlety fails us we must simply make do with cream pies.",
  "Love isn't love until you give it away.",
  "Those who forget the pasta are condemned to reheat it.",
  "Life is too important to be taken seriously.",
  "If people ate what they killed, there would be no more wars.",
  "Experience varies directly with equipment ruined.",
  "Just because the past runs you doesn't mean you can run from the future.",
  "The trouble with getting a life is making the payments.",
  "It's the empty can that makes the most noise.",
  "Make hay while the sun shines.",
  "A rolling stone gathers no moss.",
  "Half of the people in the world are below average.",
  "It's better to have a horrible ending than to have horrors without end.",
  "Things get worse under pressure.",
  "Those who live in stone houses shouldn't throw glass.",
  "It's who we don't say no to that defines who we are.",
  "The best thing about growing older is that it takes such a long time.",
  "There are 3 kinds of lies: lies, damned lies & statistics",
  "The most expensive component always breaks first.",
  "Many hands make light work.",
  "Nothing is so simple that it can't get screwed up.",
  "Life is full of little surprises.",
  "If it appeals to everyone, evangelists will target it.",
  "Apes evolved from creationists.",
  "Those on the cutting edge bleed a lot.",
  "Nobody notices when things go right.",
  "Two most common elements in the universe: Hydrogen & Stupidity.",
  "Only those who attempt the absurd will achieve the impossible.",
  "What goes around usually gets dizzy and falls over.",
  "The problem with the gene pool is that there is no lifeguard.",
  "People who live in glass houses... shouldn't.",
  "Thinking about the past is a great excuse to waste the present and forget about the future.",
  "All the money in the world can't buy you a smidgen of ignorance.",
  "The pants were very sad, they were depressed.",
  "The early cat gets the bird if the early dog hasn't already eaten it.",
  "Things will get worse before they get better.",
  "Tis better to be thought a fool, then to open your mouth and remove all doubt.",
  "If Murphy's Law can go wrong, it will.",
  "One on-topic post a day keeps the moderator at bay",
  "To err is Human, to blame it on someone else is politics.",
  "Anything worth doing is worth overdoing.",
  "Some authors should be paid by the quantity NOT written.",
  "All the world's a stage... most of us are just stagehands.",
  "A motion to adjourn is always in order.",
  "So many cheques, so little money.",
  "For every action, there is an equal and opposite criticism.",
  "Inside every short man is a tall man doubled over in pain.",
  "Every man has a price.",
  "Geochronologists will date any old thing.",
  "Test tube babies shouldn't throw stones.",
  "Religions change, but beer and wine remain.",
  "A stitch in time would have confused Einstein.",
  "Practice makes perfeckt.",
  "Floggings will continue until morale improves.",
  "Blessed is the end-user who expects nothing, for ye shall not be disappointed.",
  "A good plan today is better than a perfect plan tomorrow.",
  "Everything in time is birth to some and death to others.",
  "The colder the X-Ray table, the more of your body is required on it.",
  "Sheep go to heaven, goats go to hell.",
  "When the chips are down, the buffalo is empty.",
  "The government solution to a problem is usually as bad as the problem.",
  "All general statements are false.",
  "Have an affair. It will break up the monogamy.",
  "He who laughs last usually gets a shot in the face.",
  "Everything put together sooner or later falls apart.",
  "You know the price of everything and the value of nothing.",
  "What will be, will be.",
  "Philosophers can be divided into two groups: those who divide philosophers into two groups, and those who don't.",
  "If a problem has a single neck, it has a simple solution.",
  "If it's not nailed down, it's fair game.",
  "So many lawyers, so few bullets.",
  "History doesn't repeat itself. Historians do.",
  "There is more to life than increasing its speed.",
  "You can be a king or a street-sweeper, but everybody at the end dances with the Grim Reaper.",
  "It may be that your sole purpose in life is simply to serve as a warning to others.",
  "What the hell, go and put all your eggs in one basket.",
  "A little greed can get you lots of stuff.",
  "Expensive silk ties attract spaghetti sauce.",
  "The real world is a special case.",
  "Life is like being thrown into a bed of roses. You get to smell the roses and feel the thorns.",
  "The best way to a man's heart is to saw his breast plate open.",
  "Time may be a great healer, but it's a lousy beautician.",
  "The nice thing about having nothing is you don't have to worry about losing it.",
  "It's hard to make a comeback when you haven't been anywhere.",
  "Truth is stranger than fiction.",
  "People have one thing in common: they are all different.",
  "Who dies, wins.",
  "Ill-bred children are always displaying their pest manners.",
  "A king's castle is his home.",
  "History does not repeat itself, but it often rhymes.",
  "What you don't do is always more important than what you do do.",
  "The average woman would rather have beauty than brains because the average man can see better than he can think.",
  "There are few problems that can't be solved with high explosives.",
  "Whatever you delete today, you desperately need tomorrow.",
  "He who laughs last probably doesn't understand the joke.",
  "Reality can be beaten with enough imagination.",
  "Murphy's law only fails when you try to demonstrate it.",
  "You're never too old to learn something stupid.",
  "There is more room in your head for thoughts than thoughts in your head for room.",
  "Writing about music is like dancing about architecture.",
  "To succeed in politics, it is often necessary to rise above your principles.",
  "At the feast of ego, everyone leaves hungry.",
  "Eagles may soar, but weasels aren't sucked into jet engines.",
  "Laugh and the world thinks you're an idiot.",
  "Crime wouldn't pay if the government ran it.",
  "It's only fun if you can get in trouble.",
  "One good turn gets most of the blankets.",
  "Nothing ever goes away.",
  "A bird in the hand is safer than one overhead.",
  "For him to get an idea, it would be a surgical process.",
  "A friend in need is a pest indeed.",
  "Anything can be made to work if you fiddle with it long enough.",
  "It is better to copulate than never.",
  "Blessed are the censors, for they shall inhibit the earth.",
  "The Two Rules of Success: 1. Don't tell everything you know.",
  "If an experiment works, something has gone wrong.",
  "After things go from bad to worse the cycle repeats.",
  "Money can't buy everything. That's what credit cards are for.",
  "The greatest productive force is human selfishness.",
  "The real trick to carrying on is not getting carried away.",
  "There's no point in being grownup if you can't be childish sometimes.",
  "Having a Smoking Section in a restaurant is a little like having a Peeing Section in a pool!",
  "Corrugated iron is really groovy.",
  "No amount of careful planning will ever replace dumb luck.",
  "It's not just reality that matters.",
  "No job is so simple that is can't be done wrong.",
  "Two wrongs don't make a right, but three rights make a left.",
  "When you pull the pin on Mr Grenade, he is no longer your friend.",
  "Heisenberg Might Have Slept Here.",
  "Everything is possible; just not too probable.",
  "Rome did not create a great empire by having meetings, they did it by killing all those who opposed them.",
  "The world's so terrible that one can only make fun of it.",
  "If it can't be expressed in figures, it is not science; it is opinion.",
  "He who laughs last thinks slowest.",
  "You can't dream too much; you can't do enough to make your dreams come true.",
  "Romulans are so ruthless because every day is a bad hair day.",
  "Curiosity killed the cat. What the heck they got 9 lives.",
  "Money won't buy happiness, but it will get a dinner date.",
  "You don't have to conform to the values of your peers. It gets pretty boring sitting home every night though.",
  "Old musicians don't die... they just decompose.",
  "Many a family tree needs trimming.",
  "It's bad luck to be superstitious.",
  "To err is human, to moo is bovine.",
  "Everything is unimportant in some way.",
  "If love is blind, lingerie makes great Braille.",
  "Until you walk a mile in another man's moccasins you can't imagine the smell.",
  "All that glitters is not gold.",
  "God spelled backwards becomes Dog.",
  "Gravity doesn't exist. Earth sucks.",
  "Everything takes longer than you think.",
  "The only reason people get lost in thought is because it's unfamiliar territory.",
  "To err is human, to blame it on a computer is even more so.",
  "Gravity always wins.",
  "If a woman has to choose between catching a fly ball and saving an infant's life, she will choose to save the infant's life without even considering if there are men on base.",
  "He who hesitates too long, must change his underwear.",
  "Opposites attract.",
  "Mankind is naturally evil, society inhibits it.",
  "The problem with people who worship themselves is when they get together their religions conflict.",
  "Life's biggest question is whether or not you're happy - not with others, but with yourself.",
  "Let he who has no stones cast the first sin.",
  "All work and no play, will make you a manager.",
  "A journey of a thousand miles begins with a cash advance.",
  "Success always occurs in private, and failure in full view.",
  "Change is inevitable, except from a vending machine.",
  "The whole purpose of your life is to serve as a warning to others.",
  "If you are given an open-book exam, you will forget you book.",
  "So many pedestrians, so little time.",
  "Still waters run deep.",
  "The worst thing about censorship is [deleted by censorship].",
  "Some have morals, some don't, most simply ignore them.",
  "Giving money and power to the government is like giving whiskey and car keys to teenage boys.",
  "Friends may come and go, but enemies accumulate.",
  "Adding manpower to a late software project makes it later.",
  "Predestination was doomed from the start.",
  "There is always a law against doing anything interesting.",
  "Old hippies never die, they just flashback!",
  "In theory, everything works.",
  "When you swim in the creek, and an eel bites your cheek, that's a moray!",
  "The more things change, the more they stay the same.",
  "It's the squeaky wheel that gets the grease.",
  "Life's a trip and then you run out of Travelers' Checks.",
  "Too much of a good thing is wonderful.",
  "It's only a hobby... only a hobby... only a",
  "The reward for a job well done is more work.",
  "Once a job is fouled up, anything done to improve it only makes it worse.",
  "Moderation is good, but boring.",
  "The shortest distance between two puns is a straight line.",
  "Growing old is mandatory; growing up is optional!!",
  "It's only a game until you lose.",
  "In 20 years there will be radio stations playing classic rap.",
  "When it comes to thought some people stop at nothing.",
  "Familiarity breeds contempt.",
  "There is no need to lie your way through life, just keep the truth at a safe distance.",
  "The more you run over a dead cat, the flatter it gets.",
  "Two wrongs are only the beginning.",
  "A fool and his money are soon elected.",
  "Everywhere is walking distance if you have the time.",
  "In spite of the cost of living, it's still popular.",
  "The trouble with our times is that the future is not what it used to be.",
  "The solution to a problem changes the nature of the problem.",
  "Faith will move mountains.",
  "Nothing cures insomnia like the realization that it's time to get up.",
  "All men are created unequal.",
  "It's not what you say in your argument, it's how loud you say it.",
  "Blessed are the pessimists, for they have made backups.",
  "Money won't buy happiness, but it's a great down payment.",
  "Nobody gets out of the Bermuda Triangle. Not even for lunch.",
  "The fatter you are, the harder it is to see your feet.",
  "Love thine enemies...it really pisses them off.",
  "A closed mouth gathers no foot.",
  "Chicken little only has to be right once.",
  "Resistance is useless! (If < 1 ohm)",
  "The unexamined life is not worth living.",
  "Heisenburg probably rules.",
  "A drink a day keeps the shrink away.",
  "Man loves little and often, woman much and rarely.",
  "Money can't buy love. But it CAN rent a very close imitation.",
  "Some days you're the dog, some days you're the hydrant.",
  "Inside every large problem is a small problem struggling to get out.",
  "He who lives by the sword shall die by the sword.",
  "It's not over till it's over.",
  "Nature abhors a vacuum.",
  "Life's a beach, and then you drown.",
  "Laugh at your problems, everyone else does.",
  "This statement is false.",
  "The key to a good deal in life is not making a big deal about anything.",
  "The course of progress: Most things get steadily worse.",
  "LSD melts in your mind, not in your hands."
]
