[
  "A bird in the hand is safer than one overhead.",
  "A bird in the hand is generally dead.",
  "A closed mouth gathers no foot.",
  "A drink a day keeps the shrink away.",
  "A fool and his money are soon elected.",
  "A friend in need is a pest indeed.",
  "A good plan today is better than a perfect plan tomorrow.",
  "A journey of a thousand miles begins with a cash advance.",
  "A kind word and gun gets you more than a kind word alone.",
  "A king's castle is his home.",
  "A little greed can get you lots of stuff.",
  "A man who smiles when things go wrong knows who to blame.",
  "A man's house is his hassle.",
  "A motion to adjourn is always in order.",
  "A rolling stone gathers no moss.",
  "A seminar on Time Travel will be held two weeks ago.",
  "A stitch in time would have confused Einstein.",
  "Absence makes the heart grow fonder.",
  "Actions speak louder than words.",
  "Adding manpower to a late software project makes it later.",
  "Affirmative Action is mediocrity's answer to Darwin.",
  "After all is said and done, usually more is said.",
  "After things go from bad to worse the cycle repeats.",
  "All general statements are false.",
  "All men are created unequal.",
  "All Scottish cuisine is based on a dare.",
  "All that glitters has a high refractive index.",
  "All that glitters is not gold.",
  "All the money in the world can't buy you a smidgen of ignorance.",
  "All the world's a stage... most of us are just stagehands.",
  "All things being equal, you lose.",
  "All work and no play, will make you a manager.",
  "An ounce of image is worth a pound of performance.",
  "Anything can be made to work if you fiddle with it long enough.",
  "Anything worth doing is worth overdoing.",
  "Anything worth doing, is worth getting someone else to do.",
  "Apes evolved from creationists.",
  "At the feast of ego, everyone leaves hungry.",
  "Blessed are the censors, for they shall inhibit the earth.",
  "Blessed are the meek, for they make great scapegoats.",
  "Blessed are the pessimists, for they have made backups.",
  "Blessed is the end-user who expects nothing, for ye shall not be disappointed.",
  "Change is inevitable, except from a vending machine.",
  "Chess players mate better.",
  "Chicken little only has to be right once.",
  "Committees do harm merely by existing.",
  "Complex problems have simple, easy-to-understand wrong answers.",
  "Corrugated iron is really groovy.",
  "Crime wouldn't pay if the government ran it.",
  "Curiosity killed the cat. What the heck they got 9 lives.",
  "Dates in Calendar are closer than they appear.",
  "Desserts spelled backwards becomes stressed.",
  "Eagles fly; but weasels aren't sucked into jet engines.",
  "Eagles may soar, but weasels aren't sucked into jet engines.",
  "Elevators smell different to midgets.",
  "Even if you win the rat race, you're still a rat.",
  "Every man has a price.",
  "Every silver lining has a cloud.",
  "Everybody is somebody else's weirdo.",
  "Everybody lies; but it doesn't matter much since nobody listens.",
  "Everything changes except change.",
  "Everything in time is birth to some and death to others.",
  "Everything inspires. But one things more than others.",
  "Everything is possible; just not too probable.",
  "Everything is unimportant in some way.",
  "Everything put together sooner or later falls apart.",
  "Everything takes longer than you think.",
  "Everywhere is walking distance if you have the time.",
  "Expensive silk ties attract spaghetti sauce.",
  "Experience varies directly with equipment ruined.",
  "Faith will move mountains.",
  "Familiarity breeds contempt.",
  "Floggings will continue until morale improves.",
  "For every action, there is an equal and opposite criticism.",
  "For every idiot-proof system, a new improved idiot will arise to overcome it.",
  "For every problem there is a simple solution, and it's always wrong.",
  "For him to get an idea, it would be a surgical process.",
  "Friends come and go but enemies accumulate.",
  "Friends may come and go, but enemies accumulate.",
  "Generalizations (as a rule) are bad.",
  "Geochronologists will date any old thing.",
  "George Washington's brother was the uncle of our country.",
  "Giving money and power to the government is like giving whiskey and car keys to teenage boys.",
  "God spelled backwards becomes Dog.",
  "Golf scores are directly proportional to the number of witnesses.",
  "Good fences make good neighbors.",
  "Good generally conquers evil. Unless, of course, good is stupid.",
  "Good girls go to heaven. Bad girls go everywhere.",
  "Gravity always wins.",
  "Gravity doesn't exist. Earth sucks.",
  "Growing old is mandatory; growing up is optional!!",
  "Half a loaf is better than none.",
  "Half of the people in the world are below average.",
  "Happiness can't buy money.",
  "Hard work pays off in the future. Laziness pays off now.",
  "Hard work will never break up with you.",
  "Have an affair. It will break up the monogamy.",
  "Having a good time can be deadly.",
  "Having a Smoking Section in a restaurant is a little like having a Peeing Section in a pool!",
  "He who dies with the most of anything, is still dead.",
  "He who hesitates is last.",
  "He who hesitates too long, must change his underwear.",
  "He who laughs last probably doesn't understand the joke.",
  "He who laughs last thinks slowest.",
  "He who laughs last usually gets a shot in the face.",
  "He who lives by the sword shall die by the sword.",
  "He who throws mud loses ground.",
  "Heisenberg may have been right.",
  "Heisenberg Might Have Slept Here.",
  "Heisenburg probably rules.",
  "High explosives are applicable where truth and logic fail.",
  "History does not repeat itself, but it often rhymes.",
  "History doesn't repeat itself. Historians do.",
  "Humankind cannot bear very much reality.",
  "Hungarian food is OK if you like dog tartare.",
  "If a problem has a single neck, it has a simple solution.",
  "If a woman has to choose between catching a fly ball and saving an infant's life, she will choose to save the infant's life without even considering if there are men on base.",
  "If an experiment works, something has gone wrong.",
  "If it appeals to everyone, evangelists will target it.",
  "If it can't be expressed in figures, it is not science; it is opinion.",
  "If it's not nailed down, it's fair game.",
  "If love is blind, lingerie makes great Braille.",
  "If Murphy's Law can go wrong, it will.",
  "If people ate what they killed, there would be no more wars.",
  "If we could just get everyone to close their eyes and visualize world peace for an hour, imagine how serene and quiet it would be until the looting started.",
  "If we don't know it already, chances are we're not interested in learning it.",
  "If you are given an open-book exam, you will forget you book.",
  "If you can survive death, you can probably survive anything.",
  "Ill-bred children are always displaying their pest manners.",
  "In 20 years there will be radio stations playing classic rap.",
  "In life's rat race, it's not how fast you can run but how good you deal with the cats that matters.",
  "In life's wallet, there's no compartment for change.",
  "In spite of the cost of living, it's still popular.",
  "In theory, everything works.",
  "In today's world, anyone who is not confused just isn't thinking straight.",
  "Inside every large problem is a small problem struggling to get out.",
  "Inside every short man is a tall man doubled over in pain.",
  "It is better to copulate than never.",
  "It looks like blind screaming hedonism won out.",
  "It may be that your sole purpose in life is simply to serve as a warning to others.",
  "It takes a big man to cry, but it takes a bigger man to laugh at that man.",
  "It's amazing how mature wisdom resembles being too tired.",
  "It's an ill wind that blows no good.",
  "It's bad luck to be superstitious.",
  "It's better to have a horrible ending than to have horrors without end.",
  "It's hard to make a comeback when you haven't been anywhere.",
  "It's not just reality that matters.",
  "It's not over till it's over.",
  "It's not what you say in your argument, it's how loud you say it.",
  "It's not when you get up, but when you get down.",
  "It's okay to laugh in the bedroom, but don't point.",
  "It's only a game until you lose.",
  "It's only a hobby... only a hobby... only a",
  "It's only fun if you can get in trouble.",
  "It's only hopeless if you walk away.",
  "It's the empty can that makes the most noise.",
  "It's the squeaky wheel that gets the grease.",
  "It's who we don't say no to that defines who we are.",
  "Its hard to get a \"head\" in the world...",
  "Just because the past runs you doesn't mean you can run from the future.",
  "Laugh and the world laughs with you. Cry and the world laughs louder.",
  "Laugh and the world thinks you're an idiot.",
  "Laugh at your problems, everyone else does.",
  "Let he who has no stones cast the first sin.",
  "Life has a lot of undocumented features.",
  "Life is a bowl of spaghetti O's. They're all zeros, you just have to eat them up.",
  "Life is cheap. It's the accessories that kill you.",
  "Life is complex. It has real and imaginary parts.",
  "Life is full of little surprises.",
  "Life is just one of those things.",
  "Life is like a package from the Unabomber... you never know what you're gonna get",
  "Life is like being thrown into a bed of roses. You get to smell the roses and feel the thorns.",
  "Life is like... an analogy.",
  "Life is recursive.",
  "Life is too important to be taken seriously.",
  "Life is too short to drink cheap beer.",
  "Life isn't weird; it's the people in it.",
  "Life's a beach, and then you drown.",
  "Life's a trip and then you run out of Travelers' Checks.",
  "Life's biggest question is whether or not you're happy - not with others, but with yourself.",
  "Life's like raisin bran. Few raisins and lots of bran.",
  "Love is blind; marriage is the eye-opener.",
  "Love isn't love until you give it away.",
  "Love thine enemies...it really pisses them off.",
  "LSD melts in your mind, not in your hands.",
  "Make hay while the sun shines.",
  "Man loves little and often, woman much and rarely.",
  "Mankind is naturally evil, society inhibits it.",
  "Many a family tree needs trimming.",
  "Many hands make light work.",
  "Men are like toilets: the good ones are taken, the rest are full of shit.",
  "Moderation is good, but boring.",
  "Money can't buy everything. That's what credit cards are for.",
  "Money can't buy happiness, but allows a choice of misery.",
  "Money can't buy happiness... but it sure makes misery a lot easier to live with.",
  "Money can't buy love. But it CAN rent a very close imitation.",
  "Money makes the world go around. Love just barely keeps it from blowing up.",
  "Money won't buy happiness, but it will get a dinner date.",
  "Money won't buy happiness, but it's a great down payment.",
  "Most people deserve each other.",
  "Murphy's law only fails when you try to demonstrate it.",
  "Nature abhors a vacuum.",
  "Nature abhors second order differential equations.",
  "Nice guys don't finish nice.",
  "No amount of careful planning will ever replace dumb luck.",
  "No job is so simple that is can't be done wrong.",
  "No matter how much you do, you'll never do enough.",
  "No matter what goes wrong, it will probably look right.",
  "No matter where you go; you're there.",
  "No one is listening until you make a mistake.",
  "No one is perfect, but some of us are closer than others.",
  "Nobody ever forgets where he buried the hatchet.",
  "Nobody gets out of the Bermuda Triangle. Not even for lunch.",
  "Nobody notices when things go right.",
  "Nostalgia is okay but not what it used to be.",
  "Nothing cures insomnia like the realization that it's time to get up.",
  "Nothing ever goes away.",
  "Nothing is illegal until you get caught.",
  "Nothing is so simple that it can't get screwed up.",
  "Nothing is wrong with you that reincarnation can't cure.",
  "Old age and treachery will beat youth and enthusiasm.",
  "Old hippies never die, they just flashback!",
  "Old musicians don't die... they just decompose.",
  "Old soldiers never die. Young ones do.",
  "Once a job is fouled up, anything done to improve it only makes it worse.",
  "One good turn gets most of the blankets.",
  "One on-topic post a day keeps the moderator at bay",
  "Only those who attempt the absurd will achieve the impossible.",
  "Open mouth, insert foot, echo internationally.",
  "Opposites attract.",
  "Out of sight, out of mind.",
  "Part-time musicians are semiconductors.",
  "People have one thing in common: they are all different.",
  "People who live in glass houses... shouldn't.",
  "People who live in glass houses shouldn't throw stones.",
  "People who think they know everything are a great annoyance to those of us who do.",
  "Philosophers can be divided into two groups: those who divide philosophers into two groups, and those who don't.",
  "Power corrupts; absolute power corrupts absolutely.",
  "Practice makes perfeckt.",
  "Predestination was doomed from the start.",
  "Pure drivel tends to drive away ordinary drivel.",
  "Reality can be beaten with enough imagination.",
  "Religions change, but beer and wine remain.",
  "Resistance is useless! (If < 1 ohm)",
  "Rome did not create a great empire by having meetings, they did it by killing all those who opposed them.",
  "Romulans are so ruthless because every day is a bad hair day.",
  "Sarcasm helps keep you from telling people what you really think of them.",
  "Schizophrenia beats being alone.",
  "Sheep go to heaven, goats go to hell.",
  "So many cheques, so little money.",
  "So many lawyers, so few bullets.",
  "So many pedestrians, so little time.",
  "Some authors should be paid by the quantity NOT written.",
  "Some days you're the dog, some days you're the hydrant.",
  "Some do, some don't, some will and some won't.",
  "Some drink at the fountain of knowledge... others just gargle.",
  "Some have morals, some don't, most simply ignore them.",
  "Still waters run deep.",
  "Street lights timed for 35 mph are also timed for 70 mph.",
  "Success always occurs in private, and failure in full view.",
  "Talk is cheap because supply exceeds demand.",
  "Taxation *with* representation isn't so hot, either.",
  "Taxes are not levied for the benefit of the taxed.",
  "Test tube babies shouldn't throw stones.",
  "The average woman would rather have beauty than brains because the average man can see better than he can think.",
  "The best thing about growing older is that it takes such a long time.",
  "The best way to a man's heart is to saw his breast plate open.",
  "The bigger they are, the harder they hit.",
  "The body of a dead enemy always smells sweet.",
  "The buck doesn't even slow down here.",
  "The colder the X-Ray table, the more of your body is required on it.",
  "The course of progress: Most things get steadily worse.",
  "The early cat gets the bird if the early dog hasn't already eaten it.",
  "The Earth is like a grain of sand, only bigger.",
  "The employer generally gets the employees he deserves.",
  "The fatter you are, the harder it is to see your feet.",
  "The generation of random numbers is too important to be left to chance.",
  "The government solution to a problem is usually as bad as the problem.",
  "The greatest productive force is human selfishness.",
  "The key to a good deal in life is not making a big deal about anything.",
  "The more things change, the more they stay insane.",
  "The more things change, the more they stay the same.",
  "The more you run over a dead cat, the flatter it gets.",
  "The most expensive component always breaks first.",
  "The new baby is like royalty, he's the prince of wails.",
  "The nice thing about having nothing is you don't have to worry about losing it.",
  "The nice thing about kleptomania is that you can take something for it.",
  "The only reason people get lost in thought is because it's unfamiliar territory.",
  "The pants were very sad, they were depressed.",
  "The problem with people who worship themselves is when they get together their religions conflict.",
  "The problem with the gene pool is that there is no lifeguard.",
  "The real trick to carrying on is not getting carried away.",
  "The real world is a special case.",
  "The reward for a job well done is more work.",
  "The rich get richer; the poor get babies.",
  "The second most preposterous notion is that copulation is inherently sinful.",
  "The shortest distance between two points is under construction.",
  "The shortest distance between two puns is a straight line.",
  "The solution to a problem changes the nature of the problem.",
  "The trouble with doing something right the first time is that nobody appreciates how difficult is was.",
  "The trouble with getting a life is making the payments.",
  "The trouble with our times is that the future is not what it used to be.",
  "The Two Rules of Success: 1. Don't tell everything you know.",
  "The unexamined life is not worth living.",
  "The way to a man's heart is through the left ventricle.",
  "The whole purpose of your life is to serve as a warning to others.",
  "The world's so terrible that one can only make fun of it.",
  "The worst thing about censorship is [deleted by censorship].",
  "The young know the rules, the old know the exceptions.",
  "Therapy helps, but screaming obscenities is cheaper.",
  "There are 3 kinds of lies: lies, damned lies & statistics",
  "There are 3 kinds of people: those who can count and those who can't.",
  "There are few problems that can't be solved with high explosives.",
  "There is always a law against doing anything interesting.",
  "There is more room in your head for thoughts than thoughts in your head for room.",
  "There is more to life than increasing its speed.",
  "There is no need to lie your way through life, just keep the truth at a safe distance.",
  "There's no point in being grownup if you can't be childish sometimes.",
  "Things get worse under pressure.",
  "Things will get worse before they get better.",
  "Thinking about the past is a great excuse to waste the present and forget about the future.",
  "This statement is false.",
  "Those on the cutting edge bleed a lot.",
  "Those who can't write, write manuals.",
  "Those who fail to understand hyperbole may lose their asymptotes.",
  "Those who forget the pasta are condemned to reheat it.",
  "Those who live by the sword get shot by those who don't.",
  "Those who live in stone houses shouldn't throw glass.",
  "Time flies like an arrow, but fruit flies like a banana.",
  "Time flies when you don't know what you're doing.",
  "Time may be a great healer, but it's a lousy beautician.",
  "Tis better to be thought a fool, then to open your mouth and remove all doubt.",
  "To be a \"proactive\" lefty in the new South Africa is to give in to the demands of the other group before they have even made those demands.",
  "To err and to blame someone else is human, but to really screw things up requires a computer.",
  "To err is human, and stupid.",
  "To err is human, to blame it on a computer is even more so.",
  "To err is Human, to blame it on someone else is politics.",
  "To err is human, to forgive is $5.00",
  "To err is human, to forgive is simply not our policy.",
  "To err is human, to moo is bovine.",
  "To err is Human, with blondes it's mandatory.",
  "To iterate is human; to recurse, divine.",
  "To join boldly infinitives which no man has joined before.",
  "To succeed in politics, it is often necessary to rise above your principles.",
  "Too many cooks spoil the broth.",
  "Too much of a good thing is wonderful.",
  "Truth is stranger than fiction.",
  "Two heads are better than one.",
  "Two most common elements in the universe: Hydrogen & Stupidity.",
  "Two thirds of Americans can't do fractions.The other half, just doesn't care.",
  "Two wrongs are only the beginning.",
  "Two wrongs don't make a right, but three rights make a left.",
  "Until you walk a mile in another man's moccasins you can't imagine the smell.",
  "War doesn't determine who's right, but who's left.",
  "What garlic is to salad, insanity is to art.",
  "What goes around usually gets dizzy and falls over.",
  "What the hell, go and put all your eggs in one basket.",
  "What will be, will be.",
  "What you don't do is always more important than what you do do.",
  "Whatever you delete today, you desperately need tomorrow.",
  "When it comes to thought some people stop at nothing.",
  "When the chips are down, the buffalo is empty.",
  "When you pull the pin on Mr Grenade, he is no longer your friend.",
  "When you swim in the creek, and an eel bites your cheek, that's a moray!",
  "Where subtlety fails us we must simply make do with cream pies.",
  "While some people need friends, most people just need someone they can be better than.",
  "Who dies, wins.",
  "Winning isn't everything, but losing isn't anything.",
  "Writing about music is like dancing about architecture.",
  "You can actually get anywhere in ten minutes if you go fast enough.",
  "You can be a king or a street-sweeper, but everybody at the end dances with the Grim Reaper.",
  "You can close your eyes to reality but not to memories.",
  "You can only be young once, but you can be immature forever.",
  "You can't be late until you show up.",
  "You can't dream too much; you can't do enough to make your dreams come true.",
  "You can't tell a book by its cover.",
  "You cannot achieve the impossible without attempting the absurd.",
  "You cannot propel yourself forward by patting yourself on the back.",
  "You cannot teach an old dog new tricks.",
  "You don't have to conform to the values of your peers. It gets pretty boring sitting home every night though.",
  "You know the price of everything and the value of nothing.",
  "You know you've landed gear-up when it takes full power to taxi.",
  "You live and you learn. Or you don't live long.",
  "You never really learn to swear until you learn to drive.",
  "You're either part of the solution or part of the precipitate.",
  "You're never too old to learn something stupid.",
  "You're only young once; you can be immature forever",
  "Your type doesn't stay around long enough to stay your type."
]
