[
  "Imitate the order taker's voice.",
  "Start the conversation by reciting today's date and saying, 'This may be my last entry.'",
  "When they repeat your order, say 'Again, with a little more OOMPH this time.'",
  "Report a petty theft to the order taker.",
  "Use these bonus words in the conversation: ROBUST FREE-SPIRITED COST-EFFICIENT UKRAINIAN PUCE.",
  "Order while using an electric knife sharpener.",
  "Amuse the order taker with little-known facts about country music.",
  "Change your accent every three seconds.",
  "Using a touch-tone, press random numbers while ordering. Ask the person to stop doing that.",
  "Psychoanalyze the order taker.",
  "Ask what the order taker is wearing.",
  "Ask what their phone number is. Hang up, call them, and ask again.",
  "Ask if they're familiar with the term 'spanking a pizza.' Make up a description to go with the term. Ask that this be done to your pizza.",
  "Order a one-inch pizza.",
  "Belch directly into the mouthpiece; then tell your dog it should be ashamed.",
  "Put the accent on the last syllable of 'pepperoni.' Use the long 'i' sound.",
  "When they say 'Will that be all?', snicker and say 'We'll find out, won't we?'",
  "Play a sitar in the background.",
  "Rent a pizza.",
  "Teach the order taker a secret code. Use the code on all subsequent orders.",
  "Order a steamed pizza.",
  "Have a movie with a good car chase scene playing loudly in the background. Yell 'OW!' when a bullet is fired.",
  "Rattle off your order with a determined air. If they ask if you would like drinks with that, panic and become disoriented.",
  "Ask for a deal available somewhere else. (e.g. If phoning Domino's, ask for a Cheeser! Cheeser!)",
  "Order two toppings, then say, 'No, they'll start fighting.'",
  "Call to complain about service. Later, call to say you were drunk and didn't mean it.",
  "Make a list of exotic cuisines. Order them as toppings.",
  "Order with a Speak-n-Spell where applicable.",
  "Say 'Are you sure this is (Pizza Place)? When they say yes, say 'Well, so is this! You've got some explaining to do!' When they finally offer proof that it is, in fact, (Pizza Place), start to cry and ask, 'Do you know what it's like to be lied to?'",
  "After ordering, say 'I wonder what THIS button on the phone does.' Simulate a cutoff.",
  "Start the conversation with 'My Call to (Pizza Place), Take 1, and. . . action!'",
  "Try to talk while drinking something.",
  "Use expletives like 'Great Caesar's Ghost' and 'Jesus Joseph and Mary in Tinsel Town.'",
  "Say 'Kssssssssssssssht' rather loudly into the phone. Ask if they felt that.",
  "Detect the order taker's psychic aura. Use it to your advantage.",
  "Answer their questions with questions.",
  "Ask about pizza maintenance and repair.",
  "Be vague in your order.",
  "Haggle.",
  "Stutter on the letter 'p'.",
  "Move the mouthpiece farther and farther from your lips as you speak. When the call ends, jerk the mouthpiece back into place and scream goodbye at the top of your lungs.",
  "Make up a charge-card name. Ask if they accept it.",
  "Put them on hold.",
  "Say it's your anniversary and you'd appreciate if the deliverer hid behind some furniture waiting for your spouse to arrive so you can surprise him/her.",
  "Sing the order to the tune of your favorite song from Metallica's 'Master of Puppets' CD.",
  "Tell the order taker a rival pizza place is on the other line & you're going with the lowest bidder.",
  "If he/she suggests anything, adamantly declare, 'I shall not be swayed by your sweet words.'",
  "When the order is repeated, change it slightly. When it is repeated again, change it again. On the third time, say 'You just don't get it, do you?'",
  "Wonder aloud if you should trim those nose hairs.",
  "Terminate the call with, 'Remember, we never had this conversation'.",
  "Order a Big Mac Extra Value Meal.",
  "Order 52 pepperoni slices prepared in a fractal pattern as follows from an equation you are about to dictate. Ask if they need paper.",
  "Mumble, 'There's a bomb under your seat.' When asked to repeat that, say 'I said 'sauce smothered with meat'.'",
  "Quote Carl Sandberg.",
  "Ask how many dolphins were killed to make that pizza.",
  "Ask if you get to keep the pizza box. When they say yes, heave a sigh of relief.",
  "Ask if the pizza is organically grown.",
  "Say you'll be able to pay for this when the movie people call back.",
  "When listing toppings you want on your pizza, include another pizza.",
  "Ask what topping goes best with well-aged Chardonnay.",
  "Say hello, act stunned for five seconds, then behave as if they called you.",
  "Start your order with 'I'd like. . . '. A little later, slap yourself and say 'No, I don't.'",
  "Dance all around the word 'pizza.' Avoid saying it at all costs. If he/she says it, say 'Please don't mention that word.'",
  "Crack your knuckles into the receiver.",
  "Order term life insurance.",
  "Ask if they would like to sample your pizza. Suggest an even trade.",
  "Ask if they have any idea what is at stake with this pizza.",
  "State your order and say that's as far as this relationship is going to get.",
  "While on the phone, fake entering puberty. Fluctuate pitch often; act embarrassed.",
  "Do not name the toppings you want. Rather, spell them out.",
  "Ask if the pizza has had its shots.",
  "Use CB lingo where applicable.",
  "Tell the order taker to tell the manager to tell his supervisor he's fired.",
  "Perfect a celebrity's voice. Stress that you won't take any crap from some two-bit can't-hack-it pimple-faced gofer.",
  "When you'ge given the price, say 'Ooooooo, that sounds complicated. I hate math.'",
  "Tell the order taker you're depressed. Get him/her to cheer you up.",
  "Eliminate verbs from your speech.",
  "When they say 'What would you like?' say, 'Huh? Oh, you mean now.'",
  "If using a touch-tone press 9-1-1 every 5 seconds throughout the order.",
  "Put an extra edge in your voice when you say 'crazy bread'.",
  "Order a slice, not a whole pizza.",
  "Learn to properly pronounce the ingredients of a Twinkie. Ask that these be included in the pizza.",
  "Shout 'I'm through with men/women! Send me a dozen of your best, Gaston!'",
  "In your breathiest voice, tell them to cut the crap about nutrition and ask if they have something outlandishly sinful.",
  "If they repeat the order to make sure they have it right, say 'OK. That'll be $10.99; please pull up to the first window.'",
  "Have your pizza 'shaken, not stirred.'",
  "Get taker's name. Later, call exactly on the hour to say, 'This is your (time of day)wake-up call, So-and-so.' Hang up.",
  "Learn to play a blues riff on the harmonica. Stop talking at regular intervals to play it.",
  "If he/she suggests a side order, ask why he/she is punishing you.",
  "Make the first topping you order mushrooms. Make the last thing you say 'No mushrooms, please.' Hang up before they have a chance to respond.",
  "Engage in some serious swapping.",
  "Give them your address, exclaim 'Oh, just surprise me!' and hang up.",
  "If your crazy ideas are being rejected by the order taker,  Say, in your best pouty voice, 'Last guy let me do it.'",
  "Tell them to put the crust on top this time.",
  "Act like you know the order taker from somewhere. Say 'Bed-Wetters' Camp, right",
  "Offer to pay for the pizza with a public flogging.",
  "Doze off in the middle of the order, catch yourself, and say 'Where was I? Who are you?'",
  "Tell them to double-check to make sure your pizza is, in fact, dead.",
  "Ask to see a menu.",
  "Ask for the guy who took your order last time."
]
