[
  "Everyone knows the speed of light. But does anyone know the speed of dark?",
  "Why do they report power outages on TV?",
  "What about attaching razor blades to frisbees?",
  "If you melt dry ice, can I take a bath without getting wet?",
  "Why do they call them 'apartments' when they are all stuck together?",
  "Why doesn't this magnet pick up this floppy disk?",
  "What's another word for 'thesaurus'?",
  "Why is it when two planes almost hit each other it is called a 'near miss'? Shouldn't it be called a 'near hit'?",
  "Daddy, what does 'formatting' drive C mean?",
  "If someone with multiple personalities threatens to kill himself, is it considered a hostage situation?",
  "Since she won't live forever, why give her a diamond?",
  "Why doesn't 'onomatopoeia' sound like what it is?",
  "Why are they called 'stands' when they're made for sitting?",
  "You know that little indestructible black box that is used on planes, why can't they make the whole plane out of the same substance?",
  "No, I'm not an elitist. Why do you ask, peasant?",
  "Why do we sing 'Take me out to the ball game', when we are already there?",
  "Why be normal?",
  "Is there another word for synonym?",
  "Wouldn't it be nice if there was an Escape key for all of our problems?",
  "What is it that makes a complete stranger dive into an icy river to save a solid gold baby? Maybe we'll never know.",
  "Why is it, whether you sit up or sit down, the result is the same?",
  "Why did kamikaze pilots wear helmets?",
  "How come they call them buildings if they've already been built?",
  "What do you mean, you formatted the dog?",
  "You people are so apathetic. Then again, who cares?",
  "What do you suppose gives Stephen King nightmares?",
  "Why are there interstate highways in Hawaii?",
  "Illiterate? Write for free help.",
  "There's so much comedy on television. Does that cause comedy in the streets?",
  "Why is it that when you're driving and looking for an address, you turn down the volume on the radio?",
  "Shouldn't there be a shorter word for 'monosyllabic'?",
  "Find God?!? Why? Is he missing?",
  "Does a fish get cramps after eating?",
  "War, what is it good for? Experience points!",
  "Why do we drive on parkways and park on driveways?",
  "If a cow laughed real hard, would milk come out her nose?",
  "If a mute swears, does his mother make him wash his hands with soap?",
  "The truth is out there? Anyone know the URL?",
  "Since when is talking a sign of thinking?",
  "Who said things would get better?",
  "Why is there an expiration date on SOUR cream?",
  "After they make Styrofoam, what do they ship it in?",
  "How do I set my laser printer to stun?",
  "When agnostics die, do they go to the Great Perhaps?",
  "If IBMs have Bugs, do APPLES have Worms?",
  "Other than that, Mrs. Lincoln, how did you like the show?",
  "Why do they put Braille dots on the keypad of the drive-up ATM?",
  "If you have your finger touching the rearview mirror that says: 'objects in mirror are closer than they appear', how can that be possible?",
  "Did you ever notice when you blow in a dog's face he gets mad at you? But when you take him in a car he sticks his head out the window!",
  "Was today really necessary?",
  "Do we know that life has a cause?",
  "Why aren't Conservatives interested in conservation?",
  "Why does 'slow down' and 'slow up' mean the same thing?",
  "What on earth is a 'free gift'? Aren't all gifts free?",
  "Just what part of 'No' didn't you understand?",
  "Why isn't there mouse-flavored cat food?",
  "How does the guy who drives the snowplow get to work in the morning?",
  "Where do forest rangers go to 'get away from it all'?",
  "We have a defense department that has a first strike capability?",
  "How can someone 'draw a blank'?",
  "When you open a new bag of cotton balls, is the top one meant to be thrown away?",
  "Why is it called a 'tourist season' if we can't shoot at them?",
  "Why is it called a TV 'set' when you only get one?",
  "Why are builders afraid to have a 13th floor but book publishers aren't afraid to have a Chapter 11?",
  "Why is there only *one* Monopolies Commission?",
  "If trees could scream, would we be so cavalier about cutting them down? We might, if they screamed all the time, for no good reason.",
  "There is one God, but which one is He?",
  "Where does the fire go when the fire 'goes off'?",
  "If white wine goes with fish, do white grapes go with sushi?",
  "Who is 'they' anyway?",
  "How does Michael Jackson pick his nose? From a catalog!",
  "Why is the word 'Abbreviation' so long?",
  "Is this thing on?",
  "What's so great about humans anyway?",
  "Based on what you know about him in history books, what do you think Abraham Lincoln would be doing if he were alive today? 1. Writing his memoirs of the Civil War. 2. Advising the President. 3. Desperately clawing at the inside of his coffin.",
  "Do wizards use spell checkers?",
  "If Windows is User-Friendly, why do you need to read a 672 pages manual?",
  "If nothing ever sticks to TEFLON, how do they make TEFLON stick to the pan?",
  "Why are cigarettes sold in gas stations when smoking is prohibited there?",
  "When sign makers go on strike, is anything written on their picket signs?",
  "If someone has a mid-life crises while playing hide & seek, does he automatically lose because he can't find himself?",
  "A day for firm decisions!!! Or is it??",
  "Why isn't 'palindrome' spelled the same way backwards?",
  "If life's a trip, then where's my ticket?",
  "It's beautiful the way it is; why spoil it by making it legal?",
  "Of course it's the murder weapon. Who would frame someone with a fake?",
  "Have you ever imagined a world with no hypothetical situations?",
  "Why use a big, long word when a diminutive one will do?",
  "We aim to please, could you aim too please?",
  "A fly without wings... Would it be called 'a walk'?",
  "The graduate with a Science degree asks, 'Why does it work?' ; The graduate with an Engineering degree asks, 'How does it work?' ; The graduate with an Accounting degree asks, 'How much will it cost?' ; The graduate with a Liberal Arts degree asks, 'Do you want fries with that?'",
  "You know how most packages say 'Open here'. What is the protocol if the package says, 'Open somewhere else'?",
  "Instead of talking to your plants, if you yelled at them would they still grow, but only to be troubled and insecure?",
  "Any of you seen a modem carrier around here?",
  "Did you hear about the two peanuts walking down the road when one of them was assaulted?",
  "Remember when cooking didn't involve calculus?",
  "If you tied buttered toast to the back of a cat and dropped it from a height, what would happen?",
  "Is it worse to get your head handed to you, or your heart handed to you in a couple of pieces?",
  "Why is it so hard to remember how to spell 'mnemonic'?",
  "What's better... 5.25' floppy or 3.5' hard?",
  "Do you need a silencer if you are going to shoot a mime?",
  "After eating, do amphibians have to wait one hour before getting out of the water?",
  "Did you hear about the dyslexic, agnostic insomniac who stays up all night wondering if there really is a dog?",
  "Why did CNN cancel that cool 'Desert Storm' show?",
  "If ours is a man made world, why can't we remake it?",
  "If you're in a vehicle going the speed of light, what happens when you turn on the headlights?",
  "Why does flammable and inflammable mean the same thing?",
  "Why isn't phonetically spelled that way?",
  "Doesn't expecting the unexpected make the unexpected become the expected?",
  "If life deals you lemons, why not go kill someone with the lemons (maybe by shoving them down his throat)?",
  "Have you ever noticed... Anybody going slower than you is an idiot, and anyone going faster than you is a maniac?",
  "Have you tried McSquared, the pure energy fast-food?",
  "How can there be self-help 'groups'?",
  "If pro is the opposite of con, is progress the opposite of congress?",
  "If someone invented instant water, what would they mix it with?",
  "If you can't drink and drive, why do you need a driver's license to buy liquor, and why do bars have parking lots?",
  "Who needs a virus when we've got OS/2?",
  "If 7-11 is open 24 hours a day, 365 days a year, why are there locks on the doors?",
  "Why are there flotation devices under plane seats instead of parachutes?",
  "Why is it that when you transport something by car, it's called a shipment, but when you transport something by ship, it's called cargo?",
  "Why does an alarm clock 'go off' when it begins ringing?",
  "All wiyht. Rho sritched mg kegtops awound?",
  "If you try to fail, and succeed, which have you done?",
  "If 75% of all accidents happen within 5 miles of home, why not move 10 miles away?",
  "If ignorance is bliss, why aren't more people happy?",
  "You can't have everything. Where would you put it?",
  "When your pet bird sees you reading the newspaper, does he wonder why you're just sitting there, staring at carpeting?",
  "Was Jimi Hendrix's modem a Purple Hayes?",
  "If you can't be weird, why be?",
  "Who needs rhetorical questions?",
  "Why is the alphabet in that order?",
  "Does Donald Duck eat turkey for Thanksgiving?",
  "Isn't it a bit unnerving that doctors call what they do 'practice'?",
  "What is the output of a vacuum pump?",
  "If one synchronized swimmer drowns, do the others have to drown too?",
  "Hard work never killed anyone, but why take a risk?",
  "If a tree fell on the florist, would he make any sound?",
  "What does Geronimo say when he jumps out of a plane?",
  "What has four legs and an arm? A happy pitbull.",
  "Is that Windows or is that just an XT?",
  "If there were no such thing as bears, what kind of hugs would we give?",
  "How do you make Windows faster? Throw it harder!",
  "Remember the good old days, when CPU was singular?",
  "If hardware overheats, does it turn into software?",
  "Ever stop to think, and forget to start again?",
  "Just 'before' someone gets nervous, do they experience cocoons in their stomach?",
  "If you didn't get caught, did you really do it?",
  "What was the best thing *before* sliced bread?",
  "Do invisible cats drink evaporated milk?",
  "I want everything; do you have it??",
  "Why does the person that snores always fall asleep first?",
  "Why does your nose run and your feet smell?",
  "Despite the cost of living, have you noticed how it remains so popular?",
  "Is OS/2 only half an operating system?",
  "If you keep trying to prove Murphy's Law, will something keep going wrong?",
  "If Jesus was Jewish, what's he doing with a Mexican name?",
  "Will your answer to this question be in the negative?",
  "What if there were no hypothetical situations?",
  "All the world's a stage. Where does the audience sit?",
  "Is it okay to yell 'movie!' in a crowded firehouse?",
  "Why do 'tug' boats push their barges?",
  "How do you know if anything really exists? Kick it *really* hard.",
  "Why do fat chance and slim chance mean the same thing?"
]
